{"id":"41820311","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior Consultant, Data Science, IT Advisory","insider_interview":null,"response_letter_required":false,"area":{"id":"160","name":"Алматы","url":"https://api.hh.ru/areas/160?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Department: IT Advisory, Nur-Sultan and Almaty</strong></p> <p>A Senior Data Scientist would typically work works collaboratively with our business teams and our clients to show the art of the possible and to assess possible value and feasibility of applying data science in order to help solve specific business problems. This could include demoing to prospective clients, developing data strategies, leading feasibility studies, explorative data analysis, delivering minimal viable products or fully fledged projects including putting our models into production either on our own or our client’s environments</p> <p><strong>Requirements:</strong></p> <ul> <li>Completed university degree in Computer Science, Statistics, Engineering or similar technical field</li> <li>A combination of one or more of the following (proficient with programming languages like Python, R, Scala, Java, C++; skills in data engineering technologies like Hadoop, HDFS, Spark, Elasticsearch; SQL and NoSQL databases)</li> </ul> <p>Experience in data, data science, data engineering and/or other technology related capabilities:</p> <ul> <li>Experience applying advanced analytical techniques to large and varied data sets, generated and flowing at a rapid rate. Sample techniques include, but are not limited to applied machine learning, NLP, collaborative filtering and recommender systems, neural networks (including recurrent, convolutional), event detection and tracking, graph analytics.</li> </ul> <p>Experience with:</p> <ul> <li>Generating and test working hypotheses, prepare and analyze historical data, identify patterns from samples for reporting of trends and support Predictive Analytics</li> <li>Leveraging data visualization techniques and tools to effectively demonstrate patterns, outliers and exceptional conditions in the data</li> <li>Creating performance metrics and tracking processes to measure the effectiveness of Data Science solutions</li> <li>Conceptualizing necessary data governance models to support the technical solution and assure the veracity of the data</li> <li>Operating within the exploratory and experimental aspects of Data Science, e.g. to tease out interesting and previously unknown insights from vast pools of data</li> <li>Working collaboratively with other members of the Data Science and Information Architecture teams to innovate and create compelling data-centric stories and experiences</li> <li>Experience in demonstrating data science consultancy skills, e.g. running hypotheses workshops, mentoring more junior team members, preparing reports and presenting data science results.</li> </ul> <p><strong>Responsibilities:</strong></p> <ul> <li>Build data science assets (aka ‘accelerators’), in line with our global strategy, to ensure we have the platforms and core assets in place to meet market demand. This could also include supporting our continuous improvement process around our own design and development processes e.g. about how we ensure the high quality that our clients require in an efficient manner.</li> <li>As a fast growing highly specialized team, you will be involved in the running and growing of our team, e.g. through coaching colleagues, helping with knowledge management.</li> <li>Support client engagements focused on large data sets and applying advanced analytical techniques, in diverse domains such as retail price optimization, marketing strategies, customer intelligence, financial crime, risk management, smart grids, etc.</li> <li>Develop new, or tailor existing, analytical solutions designed for processing large data sets (e.g. using an Hadoop framework) and by applying advanced analytical techniques (e.g. machine learning, neural networks, NLP, A/B testing, etc.)</li> <li>Develop big data management and data analytics strategies and roadmaps for their implementation;</li> <li>Planning and organisation skills so as to work with a team, handle demanding clients and multitask effectively</li> </ul> <p> </p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Java"},{"name":"Python"},{"name":"Data Mining"},{"name":"SCALA"},{"name":"C++"},{"name":"Data Science"},{"name":"NLP"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"12.92","name":"Информационные технологии","profarea_id":"12","profarea_name":"Консультирование"},{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.113","name":"Консалтинг, Аутсорсинг","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"166599","name":"KPMG","url":"https://api.hh.ru/employers/166599?host=hh.ru","alternate_url":"https://hh.ru/employer/166599","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/384811.jpg","90":"https://hhcdn.ru/employer-logo/1981502.jpeg","240":"https://hhcdn.ru/employer-logo/1981503.jpeg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=166599&host=hh.ru","trusted":true},"published_at":"2021-06-07T14:56:29+0300","created_at":"2021-06-07T14:56:29+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=41820311","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/41820311","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}