{"id":"42011548","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Data Scientist","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":150000,"to":280000,"currency":"RUR","gross":true},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Наша компания разрабатывает аналитические решения для различных индустрий: системы предсказания спроса на товары для оффлайн-ритейлов, рекомендательные системы в банках, поисковые системы по товарам для онлайн-ритейлеров и многое другое. Мы активно развиваемся как в России (среди клиентов Сбербанк, Пятёрочка, KFC, Перекрёсток, Альфа Банк и др.), так и за рубежом. У нас молодой, дружный и опытный коллектив (более 70 человек), многие сотрудники - выпускники МГУ, МФТИ, ВШЭ, Сколтеха, ШАД Яндекса, бывшие сотрудники Яндекса, Гугла, Самсунга, Тинькова, Рамблера (однако всё это, разумеется, не является ограничителем для кандидатов — мы смотрим на навыки, а не на регалии).</strong></p> <p><strong>Мы ищем data scientist для усиления нашего направления, в котором мы занимаемся новыми для компании задачами (пример задач ушедших в продакшен силами нашего отдела: next best action в фарминдустрии, рекомендацией товаров в онлайн-магазине, оптимизацией производства в тяжелой промышленности, NER в платежных документах и многим другим). </strong></p> <p><strong>Примеры решаемых задач: предсказание спроса на сырье на ж/д станциях, составление оптимального плана экспериментов для химической промышленности, поиск фрода в графе, соответствующем тех. процессу.</strong></p> <p><strong>В будущем возможно участие в создании продуктов, в более проработанных в рамках компании направлениях (спрос, клиентская аналитика).</strong></p> <p><strong>Обязанности:</strong></p> <ul> <li>Решение задач с значительной исследовательской составляющей при помощи данных, Python, математики и здравого смысла;</li> <li>Проработка постановки задач и методов их решения совместно с коллегами и бизнес-заказчиками;</li> <li>Быстрое прототипирование решения конкретной задачи для приятного удивления заказчика, последующая презентация решений в терминах заказчика;</li> <li>Если заказчик уже удивлен, то построение воспроизводимых и переиспользуемых решений для работы с данными и моделями;</li> <li>Менторство младших коллег: ревью кода, внедрение лучших практик, активный шаринг знаний, транслирование развивающей обратной связи.</li> </ul> <p><strong>На что смотрим:</strong></p> <ul> <li>Опыт самостоятельной работы с исследовательскими задачами: уметь формулировать гипотезы, валидировать их с коллегами и бизнес-заказчиками, быстро и правильно проверять перспективные предположения, делать выводы, переведенные на бизнес-язык.</li> <li>Опыт использования ML библиотек на Python (линейные модели, boost’ы, нейросети) и понимание особенностей реализации алгоритмов в коде;</li> <li>Понимание работы ML-алгоритмов “под капотом”, достаточное для отсечения заведомо плохих моделей на старте решения.</li> <li>Умение вовремя отказаться от ML в пользу более простого, но быстрого решения, как следствие - понимание статистики и классических алгоритмов и структур данных;</li> <li>Умение построить пайплайн для полного решения задачи: получение данных (SQL, Excel, etc), обработка данных (Pandas, etc), выгрузка данных, визуализация данных (Seaborn, etc)</li> <li>Опыт решенных ML-задач хотя бы в одном из направлений: оптимизация производства, рекомендательные системы, предсказание спроса не в ритейле. Если есть другой интересный опыт решения нетривиальных задач, то будь готов поделиться.</li> </ul> <p><strong>Будет плюсом:</strong></p> <ul> <li>Опыт построения рекомендательных систем (ranker’ы, LightFM, etc.);</li> <li>Опыт работы с графами (networkX, etc);</li> <li>Опыт решения оптимизационных задач (optuna, hyperopt, линейное программирование, etc);</li> <li>Умение настраивать интерпретируемые модели или умение интерпретировать &quot;черные ящики&quot; (Shap, Lime)</li> <li>Опыт работы с системами версионирования моделей, системой управления экспериментами (DVC+MLFlow);</li> <li>Опыт работы на позиции, связанной с промышленной разработкой;</li> <li>Soft-skills и прошлый опыт работы в проектной команде</li> </ul> <p><strong>У нас:</strong></p> <ul> <li>Участие в быстром росте компании, работающей на перспективном AI рынке;</li> <li>Удаленная работа на период самоизоляции, далее возможность выбирать формат офис/удаленка</li> <li>Поддержка кандидата в профессиональном и карьерном росте;</li> <li>Совместная работа с опытными разработчиками, аналитиками данных, менеджерами, продуктологами;</li> <li>Гибкий график работы;</li> <li>Оформление полностью белое по ТК РФ;</li> <li>ДМС (включая стоматологию) в хороших клиниках Москвы и Московской области;</li> <li>Уютный офис в центре Москвы (2 минуты от м. Сухаревская) с кикером, пинг-понгом и разными вкусностями.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"Data Mining"},{"name":"SQL"},{"name":"Аналитические исследования"},{"name":"Machine Learning"},{"name":"Data Analysis"},{"name":"Ориентация на клиента"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"2223982","name":"РАБЛЗ","url":"https://api.hh.ru/employers/2223982?host=hh.ru","alternate_url":"https://hh.ru/employer/2223982","logo_urls":{"240":"https://hhcdn.ru/employer-logo/1738679.png","original":"https://hhcdn.ru/employer-logo-original/324081.png","90":"https://hhcdn.ru/employer-logo/1738678.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=2223982&host=hh.ru","trusted":true},"published_at":"2021-06-04T19:01:17+0300","created_at":"2021-06-04T19:01:17+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=42011548","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/42011548","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}