{"id":"42088120","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior Data Scientist","insider_interview":null,"response_letter_required":false,"area":{"id":"2","name":"Санкт-Петербург","url":"https://api.hh.ru/areas/2?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Циан </strong>- крупнейший в России сервис для поиска недвижимости. В конце 2020 года к нам присоединилась компания N1 — самый популярный сервис для поиска недвижимости в Сибири и на Урале. N1 объединил такие проекты, как «НГС.Недвижимость» (Новосибирск), «Е1.Недвижимость» (Екатеринбург), МЛСН (Омск), DomChel (Челябинск), «Жилком» (Красноярск), а также разделы объявлений по продаже и аренде недвижимости на 20 региональных порталах.</p> <p>19 лет мы помогаем людям найти, сдать, продать жилье по всей России. Циан не просто сайт, это высокотехнологичная компания, которая входит в топ-10 лучших сайтов по недвижимости в мире. Сейчас в компании работает 900+ сотрудников в трех офисах России - Москве, Санкт-Петербурге и Новосибирске. А ежемесячная аудитория сервисов - свыше 21 миллионов человек.</p> <p><strong>Наши текущие процессы позволят новому сотруднику работать в офисе (Москва/Питер) или же полностью удалённо.</strong></p> <p><strong>О команде</strong></p> <p><strong>Основные задачи которые решаем: </strong>персональные рекомендации; ранжирование поисковой выдачи; антифрод (модерация); поиск дубликатов объявлений, антибот, оптимизация ценообразования и многие другие. Так же есть CV, (например, нахождение одинаковых фоток, классификация), NLP и аудио (коллтрекинг).<br />Отлично подойдет тем кто любит mixed-data, ибо почти в каждой задаче можно прикрутить и тексты и фоточки и классический ML.</p> <p><strong>Наш стек: </strong></p> <ul> <li><strong>Big Data: </strong>Hadoop, Hive, Spark, Kafka;</li> <li><strong>Deep Learning:</strong> PyTorch</li> <li><strong>Classic ML:</strong> numpy, pandas, sklearn, XGBoost, LightGBM, CatBoost;</li> </ul> <p><strong>Так же в зависимости от задач есть:</strong></p> <ul> <li>PostgreSQL, Phoenix, ElasticSearch, RabbitMQ</li> </ul> <p><strong>Людям Циан важно</strong></p> <ul> <li> <p>Делать не просто продукт, а <strong>лучший продукт</strong>, который меняет клиентский опыт. Мы гордимся тем, что трансформируем рынок недвижимости, закрывая боли людей с поиском, продажей, ипотекой и арендой жилья;</p> </li> <li> <p>Решать сложные задачи и искать новые решения. Поэтому наш рабочий день иногда похож на квест, благодаря которому каждый из нас может расти намного быстрее;</p> </li> <li> <p>Влиять на продукт. Мы слушаем коллег и используем их экспертизу, идеи для выбора наилучшего решения в развитии продукта;</p> </li> <li> <p>Чувствовать себя комфортно в команде, говоря то, что думаем. Для этого мы развиваем культуру обратной связи и взаимного уважения.</p> </li> </ul> <p><strong>Задачи, которые могут стать твоими</strong></p> <ul> <li>Создание NLP моделей для анализа расшифрованных записей колл-трекинга</li> <li>Разработка моделей классического ML для оценки готовности пользователя совершить целевое действие и для оценки “привлекательности” объявлений на сайте.</li> <li>Построение оптимальной модели ценообразования в зависимости от сложности поиска покупателя для объекта жилья и внешних факторов рынка.</li> </ul> <p><strong>Мы видим на этой позиции человека, который:</strong></p> <ul> <li>Имеет прикладной опыт применения МЛ в продакшн. Быстро понимает, какой результат “может быть“, а кого “не может быть”</li> <li>Имеет представление о дизайне архитектуры ML решения: как разбить пайплайн на компоненты (бэкенд, квери-серч, инференс модели и тд)</li> <li>Способен построить процесс разметки данных (Толока, свое АПИ для ручной разметки)</li> <li>Способен разобраться почему метрики на проде отличаются от метрик на этапе валидации модели. Понимает где разница существенная, а где нет. Способен устранить проблему (например, определить какие фичи были с ликом и как его устранить)</li> <li>Умеет реализовать качественную кросс-валидацию и подобрать гиперпараметры с которыми модель не переобучена и не недообучена</li> <li>Имеет опыт в классическом ML (различные имплементации бустинга, чем отличаются)</li> <li>Знаком с популярными архитектурами сеток, может на PyTorch (или на Keras) реализовать train loop</li> <li>Знаком с методами понижения размерности: понимает суть PCA, знаком с автоэнкодерами, t-sne, svd</li> <li>Знает и применяет алгоритмы отбора фичей (boruta, генетические алгоритмы, etc)</li> <li>Знаком с основами NLP: (как минимум, fit-predict последних слоев условного bert-а, суть LSTM, проблемы с градиентом: затухание, взрыв)</li> <li>Имеет опыт работы с GPU (CUDA, nvidia-drivers; утилиты для мониторинга nvidia-smi / nvtop)</li> <li>Уверенно кодит на Python (декораторы, пакетные менеджеры, генераторы, итераторы, контекстные менеджеры)</li> </ul> <p><strong>Плюсом будет</strong></p> <ul> <li>Стат. тесты. Умение объяснить что такое p-value и умение этими инструментами пользоваться. Может посчитать, что одна модель стат. значимо отличается от другой. (t-test, хи кварат)</li> <li>Знакомство с основами CV: OpenCV (SIFT/SURF фичи, свертки, преобразование Фурье). Может реализовать edge detection, Hough transform</li> </ul> <p><strong>Мы готовы предложить</strong></p> <ul> <li> <p>Оформление по ТК, белую зарплату;</p> </li> <li> <p>Современный БЦ с фитнес-центром;</p> </li> <li> <p>Две кухни оборудованными всем необходимым: микроволновые печи, кофемашины, чайники и т.д. Также на кухне всегда доступны снеки, фрукты, кофе и чай;</p> </li> <li> <p>5 day off в год, помимо основного отпуска;</p> </li> <li> <p>Компенсацию спорта;</p> </li> <li> <p>Профессиональный рост (ЛПР, корпоративная библиотека);</p> </li> <li> <p>ДМС с первого рабочего дня (со стоматологией, госпитализацией, страховкой выезжающего за пределы нашей страны);</p> </li> <li> <p>Корпоративного врача в офисе;</p> </li> <li> <p>Бесплатную авто и вело парковку;</p> </li> <li> <p>Офисный транспорт (самокаты);</p> </li> <li> <p>Комнаты, где можно поработать в полной тишине.</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"data science"},{"name":"NLP"},{"name":"Python"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1429999","name":"Циан","url":"https://api.hh.ru/employers/1429999?host=hh.ru","alternate_url":"https://hh.ru/employer/1429999","logo_urls":{"90":"https://hhcdn.ru/employer-logo/3388809.png","240":"https://hhcdn.ru/employer-logo/3388810.png","original":"https://hhcdn.ru/employer-logo-original/736958.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1429999&host=hh.ru","trusted":true},"published_at":"2021-06-07T13:46:20+0300","created_at":"2021-06-07T13:46:20+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=42088120","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/42088120","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}