{"id":"43839223","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Data Scientist (remote)","insider_interview":null,"response_letter_required":false,"area":{"id":"4","name":"Новосибирск","url":"https://api.hh.ru/areas/4?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Data Scientist (remote)</strong></p> <p><strong>1-3 years of experience</strong></p> <p><strong>Velvetech </strong>is an international company, based in the US, with 20+ years of experience in software and hardware development for clients all around the world, especially for US clients. As an official Microsoft Gold Partner, our company is listed in the top 5 software development companies in Illinois, USA.</p> <p><em><strong>Should we save one seat in our company, just for you?</strong></em></p> <p>If you are interested in analyzing and understanding a large amount of raw data to find patterns that will support developing and maintaining computer software applications, then we will save this seat for you. Working fully remotely from the coziness of your home and many benefits, you will be able to grow and improve your skills with our cooperative and friendly team. You need to be experienced as a strong junior, middle, or middle plus expert.</p> <ul> <li> <p>Identifying valuable data sources, acquiring, processing and cleaning the data</p> </li> <li> <p>Applying data science techniques, such as machine learning, statistical modeling, and artificial intelligence to address business problems</p> </li> <li> <p>Presenting information using data visualization techniques</p> </li> </ul> <p><em><strong>Do you have all that it takes to join us?</strong></em></p> <ul> <li> <p>Knowledge of basic concepts, k-means, kNN, SVM, boosting, SGD, neural networks, etc.</p> </li> <li> <p>Work experience in scikit-learn, Keras, TensorFlow / PyTorch / Cafee, or other ML framework fields</p> </li> <li> <p>Experience in commercial/educational ML / AI projects</p> </li> <li> <p>Python 2+ experience</p> </li> <li> <p>English language (at least at the level of reading the documentation)</p> </li> </ul> <p>The following will be considered as an advantage:</p> <ul> <li> <p>Experience with:</p> <ul> <li> <p>Audio data (speaker diarization, speech-to-text, etc.)</p> </li> <li> <p>Text data (entity recognition, etc.)</p> </li> <li> <p>Time-series data</p> </li> </ul> </li> <li> <p>Other languages ​​(C #, JS)</p> </li> <li> <p>Experience in web services, web-sites, API creation</p> </li> <li> <p>It would be useful to have an account https://www.kaggle.com/ and take part in competitions there</p> </li> </ul> <p><em><strong>Why Velvetech?</strong></em></p> <ul> <li> <p>Velvetech is in the <strong>TOP 5 </strong>development companies in the <strong>USA</strong></p> </li> <li> <p>You have <strong>FLEXIBLE</strong> working conditions and a <strong>COOPERATIVE </strong>environment</p> </li> <li> <p><strong>A COMPETITIVE</strong> and performance-based salary, fair compensation and benefits</p> </li> <li> <p>Many <strong>CHALLENGING</strong> and exciting projects with new opportunities and learning</p> </li> <li> <p><strong>GROWTH</strong> opportunities, skills and competencies improvement, and professional certification</p> </li> <li> <p>In-company <strong>TRAINING</strong> (English, Software / DevOps / Project management / Design / Business)</p> </li> </ul> <p><em><strong>Velvetech tasks &amp; projects</strong></em></p> <p><em>The main goal of a potential project is </em>to determine in which room a certain person with a &quot;tag&quot; is located via using a controller and sensor data.</p> <p><em><strong>Potential tasks could be:</strong></em></p> <ul> <li> <p>Determine product characteristics based on its description</p> </li> <li> <p>Automatic assessment of vehicle load, tire wear, wheel alignment</p> </li> </ul> <p><em><strong>What do you need to know about us?</strong></em></p> <p>US clients as leading trading and financial organizations, insurance companies, large healthcare associations, pharmaceutical and energy companies, equipment manufacturers, hi-tech startups, etc.</p> <p><strong>Areas of expertise </strong>are consulting, development, implementation and support of software solutions with modern microservices backends (dotnet core, Node.js, Java, SQL Server, Postgres, Mongo, Redis, RabbitMQ), web front-ends (React, Angular), and mobile development (Swift, Kotlin, Java). Most of the systems are prepared for cloud infrastructures (AWS, Azure, GCP), and heavily rely on Docker, Kubernetes while modern CI/CD is made using Gitlab CI or Teamcity.</p> <p><strong>Principles </strong>are based on Agile Methodology, Scrum and Kanban. Various projects coded in Gitlab or Github are built with multiple coordinated teams, collaborating via JIRA, Confluence, MS Teams, and Slack. Velvetech constantly follows the Tech trends and actively cooperates with start-ups in such breakthrough areas as Machine Learning, the Internet of Things, Blockchain, FPGA, and AI.</p> <p><em><strong>Do you want to join this journey with the Velvetech team?</strong></em></p> <p>We are a friendly team of 90+ professionals where everyone is able to achieve high results and grows professionally not only due to their own knowledge and skills but also with the support of colleagues. Values that we highly appreciate are high performance, responsibility, respect, and loyalty. In order to have a highly motivated team, Velvetech invests in their people, additional education, certification, and others. You choose your career path and we are here to support you!</p> <p>People work together in harmony, encouraging each other to continuously learn, progress, and pursue perfection. Our employees enjoy working as we turn challenges into advantages to share success with each other.</p> <p>You have a chance to become a part of a friendly and professional team that creates robust software solutions to deliver maximum value to our international clients.</p> <p> </p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"C#"},{"name":"JS"},{"name":"Machine learning"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"642001","name":"Velvetech, LLC","url":"https://api.hh.ru/employers/642001?host=hh.ru","alternate_url":"https://hh.ru/employer/642001","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/798895.jpg","90":"https://hhcdn.ru/employer-logo/3636467.jpeg","240":"https://hhcdn.ru/employer-logo/3636468.jpeg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=642001&host=hh.ru","trusted":true},"published_at":"2021-05-17T08:58:08+0300","created_at":"2021-05-17T08:58:08+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=43839223","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/43839223","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}