{"id":"44148944","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Semantic Technologies Engineer (Java)","insider_interview":null,"response_letter_required":false,"area":{"id":"3","name":"Екатеринбург","url":"https://api.hh.ru/areas/3?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Exadel </strong>is a global software application development company providing innovative technology solutions to its clients. If you’re looking to grow your career in a dynamic environment rich with opportunity, Exadel has many exciting career choices. We’re currently seeking a <strong>Semantic Technologies Engineer</strong> with a penchant for Semantic Modeling and more generally knowledge Engineering. You will work in a highly motivated and diverse team.</p> <p><strong>About the Customer and Project:</strong></p> <p>The Customer provides pharmaceutical and academic researchers with the data they need to make decisions. Some of clients are working on billion-dollar drug discovery projects where early and informed decisions are worth millions. Others are working on innovative projects such as repurposing existing drugs or trying to predict certain characteristics of candidate substances. All of the Customer’s clients are deeply motivated to cure diseases more effectively and improve lives.</p> <p>The Customer’s platform brings together the best in engineering, scientific intelligence, data science and semantic modeling techniques to put the right tools into the hands of researchers and data scientists to enable them to invent, innovate and commercialize ideas, products and processes.</p> <p>The Customer can extract and link data from multiple sources and disciples, whether publicly available or proprietary, and make this data available to clients. This massively linked dataset is then channeled through the right interface where it is vital in making the best decisions, successfully getting a drug to market and ensuring patient safety.</p> <p><strong>Responsibilities:</strong></p> <ul> <li> <p>A core part of the project involves building large scale knowledge graphs that serve world-class applications in the domain of biochemistry and pharmacology. It is an imperative that knowledge graphs follow a representation scheme that ensure a smart and efficient exploitation of its content at scale.</p> </li> <li> <p>The position will be focusing on Implementing knowledge acquisition solution, modeling, exploitation of semantic data management solution and programming. In particular, the Semantic Technologies Engineer will be at the forefront of the knowledge representation effort by suggesting and implementing modeling solutions that ensure the best processing and use of the data.</p> </li> </ul> <p><strong>Requirements:</strong></p> <ul> <li> <p>Good сommand of knowledge representation techniques and technologies, semantic modelling, semantic data integration, ontology engineering, etc.</p> </li> <li> <p>Expert knowledge of Semantic Web Standards (e.g. SHACL, RDF(S), OWL, SPARQL, JSON-LD) and other W3C standards</p> </li> <li> <p>Knowledge of Semantic API, e.g. Jena</p> </li> <li> <p>Excellent Programming skills: Java, Scala is a plus, other languages can be considered e.g. Python</p> </li> <li> <p>Agile Software Development Practice and excellent communication skills</p> </li> <li> <p>Some familiarity with the current trends in Big Data Architecture: Kafka, Spark, Hadoop, Distributed Systems, Parallel Processing Frameworks, Stream/Batch Processing</p> </li> <li> <p>Affinity with the life sciences and/or chemistry domain is optional</p> </li> <li> <p>Comfortable working in a fast-moving environment</p> </li> <li> <p>Master’s degree in Artificial Intelligence (Knowledge Representation), Computer Science, or a related field. Bachelor Degree could also be considered depending on the profile and experience</p> </li> <li> <p>At least intermediate English</p> </li> </ul> <p><strong>Advantages of Working with Exadel:</strong></p> <ul> <li> <p>You&#39;ll build your expertise with Sales Support, which provides assistance with existing and potential projects</p> </li> <li> <p>You can join any Exadel community or create your own to communicate with like-minded colleagues</p> </li> <li> <p>There are opportunities for continuing education as a mentor or speaker</p> </li> <li> <p>You can take part in internal and external meetups as a speaker or listener</p> </li> <li> <p>You&#39;ll have the chance to improve your English skills with the help of native speakers</p> </li> <li> <p>We participate in cultural, sport, charity, and entertainment events, and we&#39;d love to have you there, too!</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Java"},{"name":"SCALA"},{"name":"Semantic Web Standart"},{"name":"Semantic API"},{"name":"Big Data Architecture"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"150842","name":"741 Studios","url":"https://api.hh.ru/employers/150842?host=hh.ru","alternate_url":"https://hh.ru/employer/150842","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/846450.png","240":"https://hhcdn.ru/employer-logo/3826676.png","90":"https://hhcdn.ru/employer-logo/3826675.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=150842&host=hh.ru","trusted":true},"published_at":"2021-06-10T09:03:38+0300","created_at":"2021-06-10T09:03:38+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=44148944","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/44148944","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}