{"id":"44775160","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior Data Scientist","insider_interview":null,"response_letter_required":false,"area":{"id":"160","name":"Алматы","url":"https://api.hh.ru/areas/160?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"noExperience","name":"Нет опыта"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Company Description</strong></p> <p>As the world&#39;s leader in digital payments technology, Visa&#39;s mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company&#39;s dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.</p> <p>At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.</p> <p><strong>You&#39;re</strong> an Individual. <strong>We&#39;re</strong> the team for you. <strong>Together</strong>, let&#39;s transform the way the world pays.</p> <p><strong>Job Description</strong></p> <p>We are currently seeking for individual contributor to CIS/SEE Data Science team to support our clients. The key responsibilities of the role will include descriptive, as well as predictive and prescriptive analytical projects and limited number of regular and ad-hoc reporting activities. This role assumes support of internal clients in the first place, with some exposure to external clients’ projects.</p> <p>As a Senior Data Scientist, you will be accountable for leading the design, development and implementation of analytics driven strategies and solutions. In this role you will partner with Visa Consulting &amp; Analytics, Business, Finance and Technology teams across the organization to implement solutions to drive business performance.</p> <p><strong>Data Science team within Visa</strong><br />Data Science is responsible for blueprinting and delivering projects with the appropriate analytic methodologies and techniques to solve client’s business objectives. The team closely collaborates with other analytic stakeholders to understand the business problem in order to determine the most appropriate analytic approach that provides meaningful results to clients. Responsibilities include delivering projects on time and within scope with an in-depth knowledge of big data and cutting edge data mining techniques as well as the use of predictive, classification and alternate analytic algorithms for modeling and segmentation. These analyses are foundational to corroborate or refute stated hypotheses and are incorporated in the final client-facing solutions. The team is responsible for continuously creating and protecting analytic IP resulting<br />from project learning.</p> <p>Global Data Science team is the engine of analytics at Visa; this is a high-performing team of data scientists, data analysts, statisticians, and business analysts from a variety of countries – serving the Asia Pacific, Central Europe, Middle East and Africa geographies.<br />Visa DS is looking for a hands-on manager, a person that earns trust and respect of the team. The Manager must be results oriented, highly organized, and must, must be focused on delivering innovative analytics work.</p> <p><strong>This role doesn&#39;t involve team management</strong></p> <p> </p> <p><strong>Responsibilities</strong></p> <ol> <li>Conducting transaction data analysis with Hadoop/Cloud and big data technologies for internal and external clients and stakeholders, and develop deeper insights into the products using advanced and machine learning statistical methods</li> <li>Finding opportunities to create and automate repeatable analyses or build streamlined solutions for internal and external Visa clients</li> <li>Performing impact estimation of key strategic and marketing Visa activities using analytics techniques</li> <li>Promoting usage of BI self-service tools in Almaty office</li> <li>Creating user-friendly dashboards and presentations</li> <li>Building predictive models using advanced machine learning techniques; interpret and present modeling and analytical results to non-technical audience</li> <li>Collaborating with the Visa Consulting team and other requestors to fully understand<br />business requirements and desired business outcomes</li> <li>Defining detailed analytic scope and methodology, and creating analytic plan</li> <li>Executing on the analytic plan with appropriate data mining and analytic techniques</li> <li>Performing QA on data and deliverables by analysts and own deliverables</li> <li>Ensuring all project documentation is up to date and all projects are reviewed per analytic<br />plan</li> <li>Ensuring project delivery within timelines</li> <li>Building on team’s analytical skills and business knowledge</li> <li>Enhancing existing analytic techniques by promoting new methodology and best practices in analytics<br />field</li> <li>Providing subject matter expertise and quality assurance of complex data driven analytic projects</li> </ol> <p><strong>Qualifications</strong></p> <p>Obligatory skills:</p> <ul> <li>Proficiency with modeling software; experience with Python, Hadoop, Hive, Impala or similar instruments; Practical experience in building and applying machine learning models (regression, clustering, classification: gradient boosting, random forests, linear models, deep learning etc.); understanding in how do these algorithms work and end-to-end development skills from business understanding and data preparation to quality assurance of ML models</li> <li>Minimum of 5 years of analytical expertise in applying statistical and machine learning solutions to business problems (experience in payments and/or consumer banking and/or commercial banking and/or FMCG retail and/or consulting and/or heavy industry.</li> <li>Strong in defining and designing analytic approaches to business problems, strong in decomposing heavy business problems into structured and time predictable analytical tasks;</li> <li>Excellent communication skills in both spoken and written English (upper intermediate plus), Russian proficient speaker.</li> </ul> <p>At least 2 out of 3</p> <ul> <li>Degree (masters or PhD would be an advantage) in quantitative field such as statistics, mathematics, operational research, computer science, economics, or engineering or equivalent experience;</li> <li>Demonstrated resource planning and delivery skills;</li> <li>Ensure the usage of the correct analytic measures and metrics to solve the business problem; statistical experiments set up and ability to calculate business impact.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Team management"},{"name":"Data Mining"},{"name":"Retail"},{"name":"Python"},{"name":"Marketing Analysis"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"5.219","name":"Привлечение клиентов","profarea_id":"5","profarea_name":"Банки, инвестиции, лизинг"},{"id":"5.210","name":"Пластиковые карты","profarea_id":"5","profarea_name":"Банки, инвестиции, лизинг"},{"id":"1.395","name":"Банковское ПО","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.327","name":"Управление проектами","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.359","name":"Электронная коммерция","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"12.5","name":"Internet, E-Commerce","profarea_id":"12","profarea_name":"Консультирование"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"105718","name":"Visa Inc","url":"https://api.hh.ru/employers/105718?host=hh.ru","alternate_url":"https://hh.ru/employer/105718","logo_urls":{"90":"https://hhcdn.ru/employer-logo/333276.jpeg","original":"https://hhcdn.ru/employer-logo-original/208540.jpg","240":"https://hhcdn.ru/employer-logo/406133.jpeg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=105718&host=hh.ru","trusted":true},"published_at":"2021-05-21T11:34:56+0300","created_at":"2021-05-21T11:34:56+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=44775160","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/44775160","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}