{"id":"44791299","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Machine Learning Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"88","name":"Казань","url":"https://api.hh.ru/areas/88?host=hh.ru"},"salary":{"from":150000,"to":null,"currency":"RUR","gross":false},"type":{"id":"open","name":"Открытая"},"address":{"city":"Казань","street":"улица Островского","building":"27","description":null,"lat":55.788145,"lng":49.116799,"raw":"Казань, улица Островского, 27","metro":{"station_name":"Площадь Тукая","line_name":"Центральная","station_id":"49.273","line_id":"49","lat":55.787163,"lng":49.122126},"metro_stations":[{"station_name":"Площадь Тукая","line_name":"Центральная","station_id":"49.273","line_id":"49","lat":55.787163,"lng":49.122126}]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Piano is a fast-growing enterprise SaaS company with operations in Amsterdam, London, New York City, Philadelphia, and elsewhere globally. We provide enterprise software to the world’s leading media companies, including NBC Universal, the Economist, Condé Nast, Techcrunch, Bloomberg, and Hearst. Our software enables these companies to create customized digital experiences for users, restrict and sell access to content online, and analyze user behavior in order to drive engagement, loyalty, and revenue. Piano’s headquarters is in New York; the development offices are in Kazan, Izhevsk, Bratislava, Bordo, and Philadelphia.</p> <p>We hold large data volumes and now are planning to launch a machine learning project. So we are building a team in Kazan to research models and apply them to the product. In doing that, the team will define requirements for data and solve problems if data is not available. They will also follow up on the performance of their models in production.</p> <p><strong>Position Overview</strong></p> <p>The data science team at Piano is growing and we are looking for talented people who are interested in working in an international software company that is a global leader in the content monetization industry.</p> <p>The Machine Learning Engineer will be primarily responsible for ensuring that the data science solutions are robust and continuously optimized and that we can leverage the complete Piano Infrastructure to deliver those solutions.</p> <p> </p> <p><strong>Keywords: Python, Java, Git, SQL, machine learning, Airflow, Kubernetes, Tensorflow, PyTorch, gRPC, PyArrow, pandas, numpy.</strong></p> <p><strong>The role has the following responsibilities:</strong></p> <ul> <li> <p>You will be part of the Data Science team and collaborate with other tech teams to ensure we identify opportunities to scale/optimize existing and upcoming solutions;</p> </li> <li> <p>Prototype and implement optimized and robust data science solutions;</p> </li> <li> <p>Perform data analysis and exploration on top of the existing infrastructure and products;</p> </li> <li> <p>Measure and improve the quality of data, inferred user models, and the resulting actions;</p> </li> <li> <p>Design and implement new techniques and technologies in a production environment;</p> </li> <li> <p>Build solutions that enable new capabilities in areas such as Natural Language Processing and Propensity Modeling;</p> </li> <li> <p>Explore and build tooling that would make the Data Science work more efficient;</p> </li> <li> <p>Ensure that optimized solutions meet our requirements for reliability and robustness;</p> </li> <li> <p>Identify resource needs for project delivery/exploration.</p> </li> </ul> <p> </p> <p><strong>We are looking for candidates with the following qualifications:</strong></p> <ul> <li> <p>M.Sc., Ph.D., or a similar degree in Computer Science, Mathematics, or another relevant field. A broad understanding of fundamentals in machine learning, information retrieval, natural language processing, and statistics is required (relevant work experience may compensate for lack of formal education);</p> </li> <li> <p>Software engineering experience covering software engineering best practices (code quality, repo hygiene, code reviews, design documentation, continuous integration) is a plus;</p> </li> <li> <p>Data Scientist role experience covering implementing and building large data pipelines;</p> </li> <li> <p>Strong problem-solving skills. Curiosity and practical orientation. Proven ability to understand the state of the art techniques and emerging technologies and tools, and to deliver concrete results in a short time;</p> </li> <li> <p>Understanding of agile software development lifecycle and good programming skills. Mastery of Python, as well as frameworks such as Scikit-Learn, Spark, NLTK, Keras, TensorFlow, Mesos, or similar, is a plus. Understanding Java is a plus;</p> </li> <li> <p>Good collaboration skills and can work with developers and customers and everything in between in a global organization;</p> </li> <li> <p>English Upper-Intermediate.</p> </li> </ul> <p><strong>What we offer:</strong></p> <ul> <li> <p>An opportunity to work with huge amounts of real-world data and build amazing products that transform the Internet and how businesses are made;</p> </li> <li> <p>Opportunity to influence technical decisions: anyone can suggest their idea, and it will be considered;</p> </li> <li> <p>Bright, skilled, and passionate colleagues around the world;</p> </li> <li> <p>Competitive compensation;</p> </li> <li> <p>Education and personal development: you can choose conferences and trainings that will be sponsored according to your personal quarterly budget;</p> </li> <li> <p>Voluntary medical insurance: don’t worry about insurance coverage; if it’s not about plastic surgery, we’ll cover it;</p> </li> <li> <p>English language courses: you can choose personal coach, online or offline school;</p> </li> <li> <p>Relocation package covering travel costs, realtor service costs, one month of apartment rent;</p> </li> <li> <p>Flexible working time.</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Git"},{"name":"Kubernetes"},{"name":"gRPC"},{"name":"pandas"},{"name":"machine learning"},{"name":"SQL"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1479818","name":"Piano","url":"https://api.hh.ru/employers/1479818?host=hh.ru","alternate_url":"https://hh.ru/employer/1479818","logo_urls":{"90":"https://hhcdn.ru/employer-logo/1567145.png","240":"https://hhcdn.ru/employer-logo/1567146.png","original":"https://hhcdn.ru/employer-logo-original/281162.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1479818&host=hh.ru","trusted":true},"published_at":"2021-05-21T18:01:24+0300","created_at":"2021-05-21T18:01:24+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=44791299","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/44791299","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}