{"id":"44980818","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Project Manager (Marketing BI Analytics)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>SegmentStream</strong> — AI-powered data intelligence platform built for digital marketing teams.</p> <p>Our mission is to make BI and Artificial Intelligence technologies more accessible for marketing teams to achieve their goals faster without developers and data scientists.</p> <p>Our advanced SaaS platform helps companies to unify digital marketing and sales data from various data sources into their own data warehouse and apply AI-powered marketing attribution and automation to increase Return on Ad Spend across all the channels.</p> <p>We are fortunate to be VC-backed by one of the world’s leading startup accelerators - <strong>Techstars</strong>, as well as some biggest names in the B2B SaaS world, including the founders of <strong>Pipedrive, Dynamic Yield,</strong> and other great companies.</p> <p>About Project Manager role:</p> <p>We’re looking for an experienced customer-facing <strong>Project Manager</strong> who loves helping people, delivering complex projects from scratch, and who wants to be a major factor in the success of our enterprise customers.</p> <p>If you enjoy working with smart people and helping to build a company that cares about quality, you’ve found the right place.</p> <p>What you’ll do:</p> <ul> <li>Together with our customers, you will identify and understand their individual requirements for the implementation of marketing attribution and automation;</li> <li>Assist customers during the implementation stage, proactively keep our customers up to date on the progress of the projects and ensure that the relevant deadlines are met;</li> <li>Work together with a team of senior BI Analysts and Solution Architects to deliver the highest quality marketing attribution and automation projects for our enterprise clients using our powerful SegmentStream platform;</li> <li>Own &amp; control the value delivery process to the assigned list of clients — manage priorities, estimates, resources, and timelines;</li> <li>Pro-actively analyse bottlenecks in the value delivery chain and establish the processes to minimise future issues;</li> <li>Make sure clients are happy about our solution and onboarding proccess and are ready to provide a positive testimonial to share their experience partnering with SegmentStream;</li> </ul> <p>What we are looking for:</p> <ul> <li><strong>2+ years of customer-facing project management experience in a domain of digital marketing technology or marketing BI analytics</strong> — you’ve successfully managed the implementation of complex software or analytical solutions across multiple enterprise clients, stakeholders and teams;</li> <li>Knowledge of tools such as Google Analytics, Google Tag Manager, Google BigQuery (as a user or implementation manager) will be a huge bonus;</li> <li>Excellent organization and resource planning skills;</li> <li>Personable and able to keep a positive attitude under stressful and shifting circumstances;</li> <li>Excited about rolling up your sleeves and getting stuff done in an unstructured environment of a hyper-growth technology startup;</li> <li>Great communication skills;</li> <li>English (C1/C2);</li> </ul> <p>Why SegmentStream:</p> <ul> <li>Unique and high-quality SaaS product that solves a massive problem for a huge market;</li> <li>A vast portfolio of enterprise customers around the globe including the UK, US, Canada, Australia, and lots of European countries;</li> <li>VC-backed by top investors &amp; angels, including TechStars, founders of Pipedrive, Dynamic Yield, and other great SaaS entrepreneurs;</li> <li>Fast-growing, fully distributed, and international team of smart people who not only love what they do but also really good at it;</li> <li>A great company culture that is embracing functional ownership, entrepreneurial mindset, and personal growth;</li> <li>Full responsibility from day one and being part of our results-driven working environment;</li> <li>A lot of opportunities for future career growth within the company;</li> </ul> <div> <div> <div> </div> </div> </div>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Marketing Analysis"},{"name":"Project management"},{"name":"Английский язык"},{"name":"B2B Marketing"},{"name":"Google Analytics"},{"name":"Analytical skills"},{"name":"Data Analysis"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"3.328","name":"Управление проектами","profarea_id":"3","profarea_name":"Маркетинг, реклама, PR"},{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.137","name":"Маркетинг","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.474","name":"Стартапы","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1564038","name":"SegmentStream","url":"https://api.hh.ru/employers/1564038?host=hh.ru","alternate_url":"https://hh.ru/employer/1564038","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/635972.png","90":"https://hhcdn.ru/employer-logo/2985040.png","240":"https://hhcdn.ru/employer-logo/2985041.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1564038&host=hh.ru","trusted":true},"published_at":"2021-05-28T13:08:55+0300","created_at":"2021-05-28T13:08:55+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=44980818","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/44980818","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}