{"id":"45273095","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Account Manager at Grintern","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"noExperience","name":"Нет опыта"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Grintern Graduate</strong> is a team of enthusiastic people who provide young aspired talents with the opportunities to get a great career start in the startups of Silicon Valley and other US-based companies.</p> <p>Our mission is based on our belief that GenZ can master their skills and show great performance even without having previous working experience - they are ready to learn quickly and work hard, so they only need a little help with a chance to prove themselves. We give them that chance! We connect with high-potential US startups that need help and are ready to take a junior member to their team and organize those win-win situations. And you’ll be surprised - our whole process from discussing the client’s needs to the new team member’s first working day takes no longer than 2 weeks!</p> <p>The founder of Grintern, <strong>Anastasia Sartan</strong>, is a data scientist, serial female entrepreneur, and a very inspiring person. She lives in California and knows all the needs of the startups better than anyone - she has found not only the amazing career platform which you are browsing right now (yes-yes, grintern.ru) but also two more successful startups: StyleHacks - the Google and Founders Fund-backed startup, leveraging AI, and voice commerce to create a personalized shopping experience; and one of the first largest fashion e-commerce company in Russia, funded by European investors and with an acquisition offer from Asos.com in 2013.</p> <p>Now, <strong>Grintern Graduate</strong> is growing rapidly and is looking for an <strong>enthusiastic and experienced account manager</strong> who will connect with potential clients and establish partnerships to provide young talents with an opportunity to have an amazing career start.</p> <p>Is that you who we are looking for? Apply now!</p> <p> </p> <p><strong>What will you do?</strong></p> <p>— <strong>Conduct the Zoom calls</strong> with US startups’ founders to present Grintern, explain our value to them, answer their questions, work with their possible disagreements, and persuade them to partner with us.</p> <p>— <strong>Lead the client all the way further</strong> after the discussion is done - write follow-up emails, answer questions, close the deal.</p> <p>— <strong>Maintain the connection with the current clients</strong> - take care of performance management, upsell, organize sessions for the talents with our HR coaches when needed, track that the invoices are paid, etc.</p> <p>— <strong>Conduct analytics</strong> to track results and optimize the process to improve them, etc.</p> <p>— <strong>Collect and formulate use-cases</strong> that we can broadcast on our grintern.co and graduate.grintern.co websites.</p> <p>— Take an opportunity to <strong>build the sales team and improve sales processes</strong>!</p> <p> </p> <p> </p> <p><strong>Soft skills, absolutely must-have (in addition to those priorities mentioned above):</strong></p> <p>— <strong>Near-native English</strong> - you should communicate with clients freely and be a good example that talents from Eastern Europe can be totally fluent when speaking with Americans.</p> <p>— <strong>Excellent verbal communication skills</strong> - you know how to talk to Americans, how to do small talks, how to nudge, and how to deal with disagreements. And you are not afraid of talking to the founders of the greatest startups in Silicon Valley.</p> <p>— <strong>Excellent writing skills</strong> - you will communicate with clients via emails and each of your answers should be leading to the achievement of the goal - closing the deal.</p> <p>— <strong>Persistence</strong> - you do not hesitate to nudge or persuade to achieve the result.</p> <p>— Opportunity to adjust to the <strong>PST time zone</strong>.</p> <p> </p> <p><strong>What we offer:</strong></p> <p>— <strong>Full-time employment</strong> (8 working hours per day, Monday-Friday).</p> <p>— Your working hours should be adjusted to the PST time zone since all our clients are in the USA, so <strong>18:00 to 00:00 Moscow time</strong> is a must, the remaining hours can be flexible.</p> <p>— <strong>Fully remote work</strong>. You may be located in any country or city, as all of our team members are (yes, we’ve started working remotely before it became mainstream haha).</p> <p>— A great <strong>opportunity to contribute</strong> to the company with an <strong>inspiring mission</strong> and learn from the best - you will interact closely with the team of talented people who love their job and with Anastasia Sartan herself.</p> <p>— Opportunity to <strong>see the results of your work</strong>, grow the team and the company, help Grintern achieve new heights.</p> <p>— Opportunity to <strong>grow within the company</strong> - we consider only the candidates looking for a long-term commitment and desire to manage the sales team that you develop yourself.</p> <p>— <strong>Quick selection process.</strong></p> <p> </p> <p>Salary will be discussed during the interview.</p> <ul> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Английский язык"},{"name":"Customer Relationship Management"},{"name":"Analytical skills"},{"name":"B2B Продажи"},{"name":"Заключение договоров"},{"name":"Грамотная речь"},{"name":"Поиск и привлечение клиентов"},{"name":"Навыки продаж"},{"name":"Прямые продажи"},{"name":"Управление продажами"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"17.751","name":"Другое","profarea_id":"17","profarea_name":"Продажи"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"5146329","name":"Гринтернру","url":"https://api.hh.ru/employers/5146329?host=hh.ru","alternate_url":"https://hh.ru/employer/5146329","logo_urls":null,"vacancies_url":"https://api.hh.ru/vacancies?employer_id=5146329&host=hh.ru","trusted":true},"published_at":"2021-06-07T16:11:11+0300","created_at":"2021-06-07T16:11:11+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=45273095","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/45273095","working_days":[],"working_time_intervals":[],"working_time_modes":[{"id":"start_after_sixteen","name":"Можно начинать работать после 16:00"}],"accept_temporary":false}