{"id":"45300179","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Data Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>The Data Engineer supports the implementation of Company’s next generation digital platform. (S)he is responsible for building and delivering data models, executing data pipelines and ensuring accomplishment of business results. The Data Engineer works closely with company CTO, CISO, Chief Architect, Data Scientists and Partners to integrate the digital business priorities into a strategic and sustainable product roadmap.</p> <p>Digital Platfrom is a next generation industry cloud focused on providing composite digital solutions for sub-surface, surface, corporate function, Private Equity and alternative energy. It combines and analyses data from portfolio companies, capital markets and industry sources to provide state of the art Data Driven insights.</p> <p><strong>Обязанности:</strong></p> <ul> <li>Create and maintain optimal data pipeline architecture in cloud (Azure) that can be scalable</li> <li>Assemble large, complex data sets that meet functional / non-functional business requirements</li> <li>Build the infrastructure (leveraging open source / vendor tools) required for optimal extraction, transformation, and loading of data from a wide variety of data sources</li> <li>Identify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.</li> <li>Build out new API integrations to support continuing increases in data volume and complexity</li> <li>Work with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs</li> <li>Create data structures / tools for petro-technical and data scientist team members to assist them in building business intelligence applications, analytical solutions and predictive models</li> <li>Implements processes and systems to monitor data quality, ensuring production data is always accurate and available for key stakeholders and business processes that depend on it</li> <li>Lead development efforts using Agile / Scrum practices</li> <li>Writes unit/integration tests, contributes to engineering wiki, and documents work</li> </ul> <strong>Требования:</strong> <ul> <li>5+ years relevant experience as (big) data engineer</li> <li>Experience of Big Data tools like Azure analysis services, Azure Synapse Analytics, Azure Databricks and Azure HDInsight</li> <li>Experience with NoSQL databases like Cassandra, MongoDB and Cosmos DB</li> <li>Experience with relations databases like Oracle, MS SQL SERVER and MySQL databases</li> <li>Experience of data ingestion tools like Azure Data Factory</li> <li>Experience with Spark Streaming, Apache NiFi, Kafka and Azure Stream Analytics for real-time data processing</li> <li>Experience of job schedulers and runbook automation using Azure Automation</li> <li>Experience with data pipeline workflow management tools using Azure data factory, Oozie and SSIS</li> <li>Experience with programming languages: Python, Scala, Julia, Java, etc.</li> <li>Experience in Azure DevOps</li> <li>Experience with source code control environments like GIT</li> <li>Detailed knowledge of data lifecycle activities such as data definitions, data lineage and implementation of a data quality management framework</li> <li>Energy domain expertise in E&amp;P is a plus.</li> <li>Candidate must have completed at least undergraduate degree in physical sciences or engineering.</li> </ul> <strong>Условия:</strong> <ul> <li>Remote work</li> <li>Working with the American team</li> <li>In the future, relocation to the USA is possible</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Английский язык"},{"name":"Azure"},{"name":"Big Data"},{"name":"Scrum"},{"name":"Agile"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"865","name":"TerraLink","url":"https://api.hh.ru/employers/865?host=hh.ru","alternate_url":"https://hh.ru/employer/865","logo_urls":{"240":"https://hhcdn.ru/employer-logo/2655142.png","90":"https://hhcdn.ru/employer-logo/2655141.png","original":"https://hhcdn.ru/employer-logo-original/553417.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=865&host=hh.ru","trusted":true},"published_at":"2021-06-08T12:43:36+0300","created_at":"2021-06-08T12:43:36+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=45300179","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/45300179","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}