{"id":"45386254","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"IT Recruiter","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Москва","street":"Лесная улица","building":"5С","description":null,"lat":55.777783,"lng":37.586877,"raw":"Москва, Лесная улица, 5С","metro":{"station_name":"Белорусская","line_name":"Замоскворецкая","station_id":"2.19","line_id":"2","lat":55.777439,"lng":37.582107},"metro_stations":[{"station_name":"Белорусская","line_name":"Замоскворецкая","station_id":"2.19","line_id":"2","lat":55.777439,"lng":37.582107}]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Qualifications:</strong></p> <ul> <li>Ideal person would have at least 2-4 years of experience in recruiting preferably in a multinational organization, professional services firm or tech company with main focus on digital recruiting</li> <li>Strong proven background in recruiting tech and digital talents, particularly Data Scientists, Software Engineers, Product Designers</li> <li>Fluent in English</li> <li>Be brilliant at selling top talent on opportunities</li> <li>Be happy to get involved in running meetups and attracting relevant talent groups to our space</li> <li>Strong interpersonal and communication skills, ability to build strong relationships with candidates, consultants at all levels and recruiting colleagues, positive attitude and sense of fun</li> <li>Ability to work collaboratively in a virtual and local team environment, yet work independently to see projects through to completion</li> <li>Exceptional organizational and administrative skills, attention to detail yet mindful of the big picture</li> <li>Flexibility to deal with last-minute changes, ability to remain calm under pressure, flexibility to work overtime as required, especially during the peak recruiting season</li> <li>Willingness to get “hands dirty” and play an active role in all aspects of the candidate management process;</li> <li>Proactive problem-solver and strong analytical skills, having the ability to apply judgment on internal data source quality, and the ability to access external knowledge quickly</li> </ul> <p><strong>Who you’ll work with:</strong></p> <p>You will work as a part of our EEMA recruiting team with main focus on Digital &amp; Analytics recruiting in CIS.</p> <p>You will closely work with the consultants, professional development colleagues and the HR team. You will shape and coordinate the key recruiting processes and be responsible for managing our internal recruiting systems.</p> <p><strong>What you’ll do:</strong></p> <p>You will execute McKinsey recruiting strategy to identify, engage, cultivate, and hire top professionals both internationally and locally.</p> <p>In this role you will collaborate and partner with recruiters and your manager to develop comprehensive search strategies. To connect with this highly sought out talent pool, you will need to utilize networking conferences, McKinsey events, job boards, research, and other creative recruiting solutions.</p> <p>Also, you will plan, coordinate and execute all stages of the recruitment process (from administering online tests, coordinating interview days and events, cultivation).</p> <p>As a recruiter, you will be responsible for providing an exceptional candidate and stakeholder experience. You will act as a career counselor and talent advisor, working with candidates and stakeholders to navigate the recruiting journey.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"6.254","name":"Рекрутмент","profarea_id":"6","profarea_name":"Управление персоналом, тренинги"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1776","name":"McKinsey & Company","url":"https://api.hh.ru/employers/1776?host=hh.ru","alternate_url":"https://hh.ru/employer/1776","logo_urls":null,"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1776&host=hh.ru","trusted":true},"published_at":"2021-06-10T19:20:47+0300","created_at":"2021-06-10T19:20:47+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=45386254","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/45386254","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}