{"id":"45398806","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Руководитель группы NLP","insider_interview":null,"response_letter_required":false,"area":{"id":"237","name":"Сочи","url":"https://api.hh.ru/areas/237?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"noExperience","name":"Нет опыта"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>В Сочинский R&amp;D-центр одной из крупнейших Российских ИТ компаний требуется Руководитель группы NLP</p> <p><strong>Обязанности:</strong></p> <ul> <li> <p>Руководство командой, постановка задач, контроль сроков и результатов</p> </li> <li> <p>Ведение переговоров, подготовка и утверждение с заказчиками технического задания на проект и формализованного описания моделируемого бизнес-процесса.</p> </li> <li> <p>Управление процессом и участие в разработке моделей с использованием Machine Learning для решения практических задач корпорации в области обработки естественного языка: классификация, кластеризация, анализ тональности, распознавание, саммаризация, генерация, проверка, аугментация, информационный поиск.</p> </li> <li> <p>Разработка и утверждение предложенной Data Scientist архитектуры модели.</p> </li> <li> <p>Анализ и утверждение предложенных Data Scientist методов моделирования для решения бизнес-задачи</p> </li> <li> <p>Подготовка и участие в проведении демонстрации полученных результатов моделирования бизнес-заказчикам</p> </li> <li> <p>Консультирование на этапе реализации и внедрения моделей в промышленную эксплуатацию</p> </li> <li> <p>Управление процессом совершенствования текущих проектов корпорации: распознавания банковских гарантий, анализ внутренних документов, распознавание зашумленной речи осмотрщиков вагонов, тематический анализ и анализ токсичности контента, связанной с корпорацией в информационной среде и др.</p> </li> <li> <p>Управление процессом и участие в разработке комбинированных ML-подходов для анализа текстов на основе методов компьютерного зрения, обработки речи и текстов.</p> </li> <li> <p>Управление полным циклом разработки моделей: поиск и анализ научных статей в открытых реферативных базах (Arxiv, IEEE, Scopus), поиск и анализ данных в открытых источниках (Kaggle, GIT и др), формулирование и проверка гипотез, имплементирование моделей и их проверка на реальных данных, вывод моделей в production. </p> </li> <li> <p>Взаимодействие с командами, которые занимаются проектами в области компьютерного зрения, анализа речи и структурированных данных (временные ряды).</p> </li> <li> <p>Разработка учебных кейсов в области машинного обучения в интересах корпорации и проведение семинаров.</p> </li> <li> <p>Формирование годовых планов и отчетов по проделанной работе</p> </li> </ul> <strong>Требования:</strong> <ul> <li> <p>Профильное высшее образование в области технических наук: информатика, вычислительная техника, математика, компьютерная лингвистика, технология разработки ПО, интеллектуальные системы и анализ данных.</p> </li> <li> <p>Опыт ведущим специалистом или руководителем группы в области NLP от 1 года.</p> </li> <li> <p>Python от 3 лет.</p> </li> <li> <p>Общие знания обработки текстов на естественном языке: предобработка текстов, классификация, кластеризация текстов, извлечение именованных сущностей и ключевых слов, графематический, морфологический, синтаксический анализ, проверка правописания, информационный поиск и обнаружение дубликатов, дистрибутивная семантика.</p> </li> <li> <p>Прикладные знания на Python: pandas, numpy, scipy, matplotlib, sklearn,regexp, tensorflow, catboost, pytorch, web scraping и т.д.</p> </li> <li> <p>Знание и практический опыт разработки моделей машинного обучения на Python: nltk, word2vec, fasttext, spacy, gensim, keras, word2vec, doc2vec, fasttext, elmo, BERT, GCNN, LSTM, GRU, LightGBM, GPT-2.</p> </li> <li> <p>Средства работы с русским языком: pymystem3, pymorphy2, Tomita parser, yargy, udpipe, syntax net.</p> </li> <li> <p>Опыт использования Gitlab, Docker, Jira, Confluence.</p> </li> <li> <p>Знание архитектуры нейронных сетей, их слоев и модулей – RNN, CNN, seq2seq GAN,Transformer.</p> </li> <li> <p>Опыт работы с сервисами разметки данных Толока и группами разметчиков.</p> </li> <li> <p>Знание технического английского языка.</p> </li> <li> <p>Знание методологии обработки данных Crisp-DM.</p> </li> </ul> <p><strong>Желательно:</strong></p> <ul> <li> <p>Степень кандидата технических или физ-мат наук в области Computer Science</p> </li> <li> <p>Прохождение специальных курсов по машинному обучению.</p> </li> <li> <p>Участие в соревнованиях на kaggle и хакатонах.</p> </li> <li> <p>Опыт профильной преподавательской деятельности в области анализа данных, прикладного программирования и т.п.</p> </li> <li> <p>Дополнительное лингвистическое образование.</p> </li> <li> <p>Умение править и писать чистый, читаемый код на Python.</p> </li> </ul> <strong>Условия:</strong> <ul> <li> <p>Оформление по ТК</p> </li> <li> <p>Аренда жилья: 25 000 (gross) + оплата релокации.</p> </li> <li> <p>Премии по результатам года: до 30% от годового дохода (испытательный срок не учитывается)</p> </li> <li> <p>Испытательный срок 3 мес.</p> </li> <li> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"NLP"},{"name":"Python"},{"name":"Machine Learning"},{"name":"Keras"},{"name":"Tensorflow"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1326","name":"ГК «ВИЗАВИ Консалт»","url":"https://api.hh.ru/employers/1326?host=hh.ru","alternate_url":"https://hh.ru/employer/1326","logo_urls":{"90":"https://hhcdn.ru/employer-logo/2110634.jpeg","original":"https://hhcdn.ru/employer-logo-original/417140.jpg","240":"https://hhcdn.ru/employer-logo/2110635.jpeg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1326&host=hh.ru","trusted":true},"published_at":"2021-06-11T11:38:45+0300","created_at":"2021-06-11T11:38:45+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=45398806","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/45398806","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}