{"id":"42491182","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Data analyst (Sales)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Skyeng — </strong>не только школа, но и трендсеттер в онлайн-образовании. Каждый год мы запускаем новые продукты и направления, выходим на интересные рынки (как в России, так и за границей), разрабатываем образовательные технологии и методики для взрослых и детей.</p> <p>Мы делаем только то, что нужно людям. Прежде чем прорабатывать очередной продукт, проект или фичу, мы тщательно исследуем боли и потребности клиентов, штудируем статистику, анализируем данные. Каждый онлайн-урок обвешан метриками, каждое событие на лендинге трекается — и бизнес-решения не принимаются без опоры на цифры.</p> <p>Команда Sales, задачей которой является доводить потенциального ученика от момента подачи заявки до первой оплаты, в поисках сильного Data analyst.</p> <p><em><strong>Задачи</strong></em></p> <ul> <li>Поиск точек роста. Для нас наиболее важны 2 метрики: C1 = (Количество первых оплат)/(Количество поданных заявок), CSC = (Бюджет отдела Sales)/(Количество первых оплат). Одну мы пытаемся снизить, другую повысить, что нужно для этого сделать?</li> <li>Проверка гипотез. Например: операторы, у которых мало опыта, конвертируют в следующий этап значимо ниже, чем опытные. Так ли это?</li> <li>Построение системы метрик. У нас есть какие-то кусочки бизнеса, но мы не всегда понимаем, как они связаны между собой, а хочется всегда;</li> <li>Построение систем мониторинга. Дашборды, алерты. Мы же операционка;</li> <li>Строить ETL пайплайны. Да, у нас есть data engineer, но в каких-то случаях оптимальнее самому.</li> </ul> <p><em><strong>Мы ждем от тебя </strong></em></p> <ul> <li>SQL;</li> <li>Python;</li> <li>Базовая математическая статистика;</li> <li>Умение докапываться до проблемы бизнеса;</li> <li>Проактивность. Предусмотри, как плодами твоих трудов будут пользоваться, задай больше вопросов, сделай удобно и на долго, а не закрой задачу;</li> <li>Хочешь нанести бизнесу пользу. Нужны рекомендации, нужна помощь в принятии решений, графики в вакууме не нужны;</li> <li>Инициативность. Видишь проблему, решаешь проблему, наш человек;</li> <li>Обожаешь учиться.</li> </ul> <p><em><strong>Наш стек</strong></em></p> <ul> <li>Redshift;</li> <li>Postgresql;</li> <li>Airflow and Airflow 2.0;</li> <li>Tableau + Redash + Metabase.</li> </ul> <p><em><strong>Причины работать с нами</strong></em></p> <ul> <li>Для нас аналитик - полноценный член команды, он влияет на бизнес, а не выступает как интерфейс к данным.</li> <li>Data informed подход наше все, практически все решения мы принимаем на основе данных.</li> <li>У нас живое комьюнити из 70+ аналитиков. Еженедельные встречи с докладами, общий чат и мы все открыты к общению.</li> <li>Мы поощряем инициативность. Если ты видишь проблему и знаешь как ее решить - мы выделяем тебе время на проект и помогаем с его реализацией.</li> <li>Хочешь чему-то научиться? Мы либо сами научим, либо оплатим твое обучение, а потом еще дадим задачи. Хочешь в сокращение дисперсии (например CUPED) - сначала обучим, потом дадим провести эксперимент. Хочешь в Airflow - у тебя будет свободный доступ к нему. Хочешь попробовать себя в прогнозировании - тебе к нам, мы пытаемся прогнозировать практически все.</li> <li>Хочешь все подстроить под себя? Мы живем в парадигме 1 аналитик - 1 кусочек нашего бизнеса. У тебя будет свое поле, где ты решаешь, как все будет.</li> <li>Skyeng — это уникальное сочетание стабильности и движухи. Мы прибыльны и сами зарабатываем себе на развитие. Мы по-прежнему стартап с планами захватить мир.</li> <li>Скидка 50% на уроки английского каждому сотруднику и вашему другу.</li> <li>Можно работать удаленно из любой точки мира, а также из нашего уютного офиса в Москве (м. Таганская). Выбор за тобой.</li> <li>Учимся сами: регулярные доклады внутри компании, участие и выступления на конференциях.</li> <li>Самая крупная EdTech-компания России.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"SQL"},{"name":"Python"},{"name":"Business Intelligence Systems"},{"name":"ETL"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1122462","name":"Skyeng","url":"https://api.hh.ru/employers/1122462?host=hh.ru","alternate_url":"https://hh.ru/employer/1122462","logo_urls":{"240":"https://hhcdn.ru/employer-logo/3420386.png","90":"https://hhcdn.ru/employer-logo/3420385.png","original":"https://hhcdn.ru/employer-logo-original/744856.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1122462&host=hh.ru","trusted":true},"published_at":"2021-06-11T19:25:32+0300","created_at":"2021-06-11T19:25:32+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=42491182","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/42491182","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}