{"id":"42530832","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Аналитик по работе с данными / аналитик BI","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":null,"street":null,"building":null,"description":null,"lat":null,"lng":null,"raw":null,"metro":{"station_name":"Павелецкая","line_name":"Замоскворецкая","station_id":"2.101","line_id":"2","lat":55.729741,"lng":37.638693},"metro_stations":[{"station_name":"Павелецкая","line_name":"Замоскворецкая","station_id":"2.101","line_id":"2","lat":55.729741,"lng":37.638693},{"station_name":"Павелецкая","line_name":"Кольцевая","station_id":"5.102","line_id":"5","lat":55.731414,"lng":37.636294}]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><em>Компания «Хэндисофт» — это команда, которая объединяет компетенции по созданию реального экономического эффекта для бизнеса с помощью аналитики, управления качеством и визуализации данных.</em></p> <p><em>В портфеле компании имеются собственные разработки программного обеспечения в области бизнес-аналитики (BI) готовые к тиражированию. Многие из них разработаны на основе лучших международных практик (в ходе консалтинговых проектов) и апробированы на десятках клиентов в различных отраслях. В своих решениях мы предлагаем не только обработку и визуализацию данных, как десятки других BI компаний. Мы на шаг впереди. Наши продукты включают аналитические алгоритмы, которые гарантируют бизнесу реальный экономический эффект, помимо сокращения трудозатрат на функции подготовки отчетов.</em></p> <p><em>Наша совместная задача – стать лидером рынка российских BI-систем, а также уникальных предложений в области бизнес-аналитики. В нашем активе уже имеется ряд ведущих российских клиентов из финансового, промышленного и государственного секторов. Партнерство с ключевыми отраслевыми игроками открывает для нас широкие возможности по участию в крупнейших национальных бизнес-проектах. Развитие стабильных продуктов на российском рынке станет платформой для выхода на международные рынки.</em></p> <p><em>В роли <strong>«Дата аналитик Business Apps» </strong>мы предлагаем Вам участвовать в проектах по созданию и внедрению бизнес-приложений.</em></p> <p>Вы станете частью команды, отвечающей за развитие существующих и разработку новых бизнес-приложений (BusinessApps). Ценность BusinessApps в преднастроенных аналитических показателях, которые были разработаны в ходе международных консалтинговых проектов и имеют практическое применение у наших клиентов и партнеров.</p> <p>Ваша роль – работа с данными от наших клиентов, вкл. их валидирование, моделирование и разработка алгоритмов, а также визуализация результатов в нашем BI. Своей целью мы ставим разработку/адаптацию бизнес-приложения, с помощью которого клиент сможет достигать экономических эффектов. Вы станете ключевой частью этого процесса.</p> <p><em><strong>Какие задачи будут стоять перед Вами?</strong></em></p> <ul> <li>Быть частью команды по продукту (бизнес-приложениям) и поддерживать ее в раннем прототипировании, разработке MVP и дальнейшем развитии бизнес-приложений;</li> <li>Найти лучший и самый простой способ для реализации и тестирования алгоритмов;</li> <li>Настройка алгоритмов выгрузки, трансформации данных, проверки качества данных;</li> <li>Формулирование гипотез и выявление проблем, подлежащих проверке;</li> <li>Проведение валидирования и глубинного анализа данных, а также обобщение результатов в данных;</li> <li>Настройка аналитических отчетов и дашбордов.</li> </ul> <p><em><strong>Помните – мы команда и будем поддерживать Вас с ходе реализации каждой из перечисленных задач.</strong></em></p> <p><strong><em>Отрасли проектов:</em></strong> Промышленность; Добыча ресурсов; Ритейл и логистика; Финансовый сектор (банки, страховые компании); Госсектор и пр.</p> <p><em><strong>Что мы ожидаем от кандидатов? Мы понимаем, что Вы можете не быть экспертом в каждом из обозначенных направлений.</strong></em></p> <ul> <li>Релевантный опыт в области анализа данных (сбор, обработка, анализ и визуализация данных, синтез результатов и их коммуникации клиенту) – более 2-3 лет;</li> <li>Очень желательно иметь знания в области математики / статистики / алгоритмов машинного обучения;</li> <li> <p><strong>Обязательно знание языка SQL и практический опыт работы с одним или нескольким аналитическими инструментами для визуализации (например, PowerBI, Qlik, Tableau, и т.п.);</strong></p> </li> <li> <p> </p> <p><strong>Плюсом будет опыт работы с Python, R, Matlab, Spark, Hadoop;</strong></p> </li> <li>Желателен опыт совместной работы с командами разработчиков для разработки прототипов и программных продуктов, которые могут быть развернуты в различных средах;</li> <li>Желателен опыт создания и внедрения отраслевых аналитических продуктов с реальным экономическим эффектом для клиента (BusinessApps);</li> <li>Желательно знание английского языка.</li> </ul> <p><strong>Что мы предлагаем?</strong></p> <p>Чтобы помочь вам достигать высоких результатов, мы:</p> <ul> <li>Обеспечим высокий уровень свободы в принятии решений по развитию направления;</li> <li>Предоставим все для эффективной работы: мобильная связь, ноутбук, CRM, такси;</li> <li>Обеспечим конкурентный уровень заработной платы;</li> <li>Поддержим ваше развитие и предоставим возможности для карьерного роста;</li> <li>Комфортные условия работы в офисе в центре города (м. Павелецкая);  </li> <li>Гибридный график работы с 10.00 до 19.00 с возможностью корректировки;  </li> <li>ДМС, стоматология;</li> <li>Регулярные совместные, командные мероприятия;  </li> <li>В офисе доступны: кофе, чай, сладости;</li> <li>А еще мы очень заинтересованы найти руководителя проектов, но в идеале, если мы Вас вырастим сами.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"MATLAB"},{"name":"SQL"},{"name":"Java"},{"name":"Английский язык"},{"name":"PowerBI"},{"name":"Qlik"},{"name":"Tableau"},{"name":"Spark"},{"name":"Hadoop"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.272","name":"Системная интеграция","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.113","name":"Консалтинг, Аутсорсинг","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1407995","name":"Хэндисофт","url":"https://api.hh.ru/employers/1407995?host=hh.ru","alternate_url":"https://hh.ru/employer/1407995","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/571601.png","90":"https://hhcdn.ru/employer-logo/2727873.png","240":"https://hhcdn.ru/employer-logo/2727874.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1407995&host=hh.ru","trusted":true},"published_at":"2021-06-07T17:24:45+0300","created_at":"2021-06-07T17:24:45+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=42530832","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/42530832","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}