{"id":"43349498","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Principal Software Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":6500,"to":null,"currency":"USD","gross":true},"type":{"id":"open","name":"Открытая"},"address":{"city":"Калуга","street":"улица Глаголева","building":"3","description":null,"lat":54.531528,"lng":36.271636,"raw":"Калуга, улица Глаголева, 3","metro":null,"metro_stations":[]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>From our founding until now, our mission has remained the same: to remove the engineering burden from data teams by standardizing and fully automating data connectors. With Fivetran, your data just arrives in your warehouse, canonical and ready to query, no engineering or maintenance required. As we watch more and more companies leverage our technology to become truly data-driven, we’re proud not only of our growth but also of the fact that we’ve grown without compromising our core values.</p> <p><strong>Integrity.</strong></p> <p>We do the right thing, even when it&#39;s harder in the short run. We challenge the status quo by reasoning from first principles.</p> <p><strong>Initiative.</strong></p> <p>Fivetran belongs to all of us. We take ownership and are accountable for getting things done. Through curiosity, learning, and coaching, we grow as individuals and teams.</p> <p><strong>One team, one dream.</strong></p> <p>We share the pains and successes of our customers, partners and colleagues. We seek, gather, and trust a diverse group of teammates with different perspectives to guide Fivetran&#39;s progress.</p> <p>If these values resonate with you, we’d love to hear from you.</p> <p> </p> <p><strong>About the role:</strong></p> <p><strong>Fivetran is looking for an ambitious, accomplished, and independent Principal Software Engineer who will make a big impact at a fast-growing company.</strong> You will play a vital role in building and improving our software architecture foundation, guiding our teams to build the infrastructure to deliver the reliable operation of our data pipeline service and work with them hands-on building challenging new features. We&#39;re looking for people who can understand the key values that make our product great and implement those values in the many small decisions you make every day as one of our most senior engineers.</p> <p><strong>Candidates are considered for both office work (Kaluga) and remote work.</strong></p> <p><strong>Fivetran is the epitome of data-driven-development</strong> — our engineering team is laser-focused on building a world-class product that:</p> <p><strong>Facilitates Data Analytics</strong> — our mission is to reliably deliver best-in-class schemas, and clean data, designed to be intuitively useful to analysts.</p> <p><strong>Contributes to our Community</strong> — we’re developing tools like Data Lakes, dbt-based Transformations, and schema explorers to empower analysts to choose the best tools and to make those tools more powerful.</p> <p><strong>Is Absolutely Dependable</strong> — we’re working to make Fivetran the most reliable and secure component of our customers’ data infrastructure.</p> <p><strong>We emphasize using no-nonsense tools </strong>and take great pride in the simplicity and effectiveness of the systems we build. Our product is built on Java, React and Typescript with utilization of Postgres and Cloud technologies.</p> <p><strong>Requirements:</strong></p> <ul> <li> <p>Higher education in software engineering and computer science, 12+ years of experience. </p> </li> <li> <p>Architecture working experience more than 5 years. </p> </li> <li> <p>Demonstrated expert ability to successfully drive and lead large-scale architectural projects. </p> </li> <li> <p>Demonstrated temperament and interpersonal skills to work effectively at multiple levels ranging from in the trenches with engineers to working with the CTO. </p> </li> <li> <p>Intensively collaborated with technical (engineers, leads) and non-technical (product managers, analysts) members in the organization to build complex system-level features. </p> </li> <li> <p>Extensive back-end development experience, preferably for an external-facing product. </p> </li> <li> <p>Wrote well-structured and performant code; hands-on in designing, building, maintaining, testing and deploying code. </p> </li> <li> <p>Experienced with the formulation of ideas; building proof-of-concept (POC) and converting them to production-ready projects. </p> </li> <li> <p>Expert Java programming, application architecture and database expertise. </p> </li> <li> <p>Experienced working in a cloud environment architecture utilizing AWS, GCP, Postgres, Kubernetes, Docker, CircleCI, or similar technologies. </p> </li> </ul> <p><strong>Nice-to-haves:</strong></p> <ul> <li> <p>Experience in data processing (ETL, ELT). </p> </li> <li> <p>Experience in export/import data pipelines. </p> </li> <li> <p>Experience in processing huge amount of data. </p> </li> </ul> <p><strong>Perks of working with us:</strong></p> <ul> <li>Medical and Life Insurance. </li> <li>Professional development and training opportunities. </li> <li>English classes. </li> <li>Unlimited coffee, office snacks and frequent catered lunches. </li> <li>Company happy hours and fun team building activities. </li> </ul> <p>Shaped by the real-world needs of data analysts, Fivetran technology is the smartest, fastest way to replicate your applications, databases, events and files into a high-performance cloud warehouse. Fivetran connectors deploy in minutes, require zero maintenance, and automatically adjust to source changes — so your data team can stop worrying about engineering and focus on driving insights.</p> <ul> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Java"},{"name":"SCALA"},{"name":"SQL"},{"name":"C++"},{"name":"Английский язык"},{"name":"information systems architecture"},{"name":"build complex system-level features"},{"name":"back-end development experience"},{"name":"application architecture"},{"name":"AWS"},{"name":"Experience in designing"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.3","name":"CTO, CIO, Директор по IT","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.327","name":"Управление проектами","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"4781818","name":"Fivetran","url":"https://api.hh.ru/employers/4781818?host=hh.ru","alternate_url":"https://hh.ru/employer/4781818","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/760242.png","90":"https://hhcdn.ru/employer-logo/3481925.png","240":"https://hhcdn.ru/employer-logo/3481926.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=4781818&host=hh.ru","trusted":true},"published_at":"2021-06-09T15:00:26+0300","created_at":"2021-06-09T15:00:26+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=43349498","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/43349498","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}