{"id":"44100256","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Data analyst (Vimbox Platform)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Skyeng — </strong>не только школа, но и трендсеттер в онлайн-образовании. Каждый год мы запускаем новые продукты и направления, выходим на интересные рынки (как в России, так и за границей), разрабатываем образовательные технологии и методики для взрослых и детей.</p> <p>Мы делаем только то, что нужно людям. Прежде чем прорабатывать очередной продукт, проект или фичу, мы тщательно исследуем боли и потребности клиентов, штудируем статистику, анализируем данные. Каждый онлайн-урок обвешан метриками, каждое событие на лендинге трекается — и бизнес-решения не принимаются без опоры на цифры.</p> <p>Команда Vimbox - интерактивная платформа, которую ежедневно используют наши преподаватели и ученики для проведения уроков в поиске талантливого аналитика.</p> <p><strong>Наши проекты\\фичи проходят через 3 основных этапа, предполагается, что аналитик участвует в каждом из них: </strong></p> <ul> <li>Планирование и оценка: анализируем суть изменения и определяем, на что оно должно повлиять;</li> <li>Внедряем изменение: отслеживаем влияние на выбранные метрики в процессе эксперимента или раскатки фичи;</li> <li>Анализирует результат: делаем выводы, оправдались ли ожидания, сформулированные в п.1).</li> </ul> <p><em><strong>Мы ждем от тебя</strong></em></p> <ul> <li>Продуктовое мышление;</li> <li>Честность, открытость, умение поддерживать коммуникацию с бизнес-холдерами;</li> <li>Умение писать сложные SQL-запросы;</li> <li>Опыт работы с BI-системами;</li> <li>Опыт в АБ тестировании, проверки гипотез.</li> </ul> <p><em><strong>Будет плюсом</strong></em></p> <ul> <li> <p>Tableau;</p> </li> <li> <p>Python на уровне “пишу функции, работаю с pandas”.</p> </li> </ul> <p><em><strong>Задачи</strong></em></p> <ul> <li>Участвовать в разработке и принятии решений по метрикам проектов: какую метрику нужно отслеживать, чтобы оценить эффект проекта; какие выбрать контр-метрики; какие выбрать прокси-метрики;</li> <li>Готовить и запускать A\\B эксперименты со стороны анализа: выбор метрик, подготовка дашбордов для отслеживания, определение границ эксперимента (выборка пользователей, длительность и т.д.), оценка результатов;</li> <li>Анализировать результаты экспериментов или результатов изменений в продукте (оценка стат. значимости результатов и т.д);</li> <li>Помогать в анализе данных по существующим фичам (например, помочь идентифицировать проблему с потерей синхронизации во время урока);</li> <li>Участвовать во внедрении системного подход к аналитике в продукте.</li> </ul> <p><em><strong>Причины пойти к нам</strong></em></p> <ul> <li> <p>Сильные продукты и социально значимые амбициозные цели. Мы меняем сферу образования и делаем учебу увлекательнее, чем Netflix.</p> </li> <li> <p>Сильное аналитическое комьюнити, внутреннее обучение от лучших специалистов в России. У нас работают топовые аналитики, и мы всячески поддерживаем обмен знаниями и свободное общение.</p> </li> <li> <p>Свобода действий. Каждый имеет возможность настраивать процессы, включаться в разнообразные проекты, запускать и развивать продукты, которые нужны людям.</p> </li> <li> <p>Продуктовый подход. Опираемся на исследования и метрики, фокусируемся на результате, который приносит клиентам реальную пользу.</p> </li> <li> <p>Удаленка здорового человека. Никто не контролирует, во сколько ты начинаешь работать и где находишься, главное — результат, которого ты пообещал достичь.</p> </li> <li> <p>Обучение и мотивация. Отправляем на внутренние и внешние профессиональные курсы за счет компании, готовим к публичным выступлениям, помогаем составить персональный план развития.</p> </li> <li> <p>Атмосфера, где слышат и понимают. Предлагай любую идею или конструктивно критикуй — твое мнение не останется без внимания и может все изменить.</p> </li> </ul> <p><em><strong>И еще</strong></em></p> <ul> <li> <p>Скидка 50% на уроки в Skyeng каждому сотруднику и его другу/родственнику.</p> </li> <li> <p>Бонусы от наших партнеров — Нетологии, Codeschool и других.</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"SQL"},{"name":"A/B тесты"},{"name":"Business Intelligence Systems"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1122462","name":"Skyeng","url":"https://api.hh.ru/employers/1122462?host=hh.ru","alternate_url":"https://hh.ru/employer/1122462","logo_urls":{"240":"https://hhcdn.ru/employer-logo/3420386.png","90":"https://hhcdn.ru/employer-logo/3420385.png","original":"https://hhcdn.ru/employer-logo-original/744856.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1122462&host=hh.ru","trusted":true},"published_at":"2021-06-11T19:25:32+0300","created_at":"2021-06-11T19:25:32+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=44100256","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/44100256","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}