{"id":"44805799","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Product manager","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Core mission:</p> <p>Gett Delivery is a platform for mega accounts, B2B and B2C customers. We are building a marketplace connecting delivery demand and couriers, and using our advanced technologies to provide the best and quickest delivery experience to our customers at an affordable price. We focus on the last-mile-delivery, and our goal is to change consumers&#39; expectations on how quickly they can receive their online goods.</p> <p>The Gett Delivery Marketplace product team is in charge of our core-technology, optimizing our marketplace efficiency, reducing delivery costs and maintaining our high service-level standards to our fast-growing B2B demand. We use data, research and feedback to guide multidisciplinary teams towards delivering value-driven outcomes.</p> <p>Our ideal candidates are passionate about product management, making an impact on the business, leveraging both quantitative and qualitative data and insights to fuel business decisions. They have great communication skills, are keen on listening, and strive in dynamic environments.</p> <p> </p> <p>Responsibilities:</p> <ul> <li>Lead the ideation, planning and development of new products and features, that will make Gett Delivery the most cost-effective and reliable delivery option to our B2B customers</li> <li>Work with other product managers, developers, data analysts, data scientists and stakeholders across our different global regions</li> <li>Understand our strategic position vs. the competition, and work day in and day out to improve it - by researching our data, listening to our customers and identifying the next innovations that will make a huge impact on the business</li> <li>Define metrics, analyze usage patterns, and solve problems that block us from reaching our goals</li> <li>Navigate in a fast-paced, fluid environment where the product development and business requirements are rapidly evolving</li> <li>Work with teams from different parts of the world and articulate our vision, priorities, challenges and opportunities</li> </ul> <p> </p> <p><strong>Requirements</strong></p> <ul> <li>2.5+ years of relevant product management experience, preferably working with marketplace products (platforms connecting demand and supply)</li> <li>Strong analytical skills with a passion for data. Previous experience in advanced analytics in Excel/SQL/Python - a plus</li> <li>A great sense for business and technology - with proven ability to work with business stakeholders, developers and data scientists under pressure, while keeping your cool</li> <li>Ability to ask the right questions, and use both quantitative and qualitative metrics to answer them</li> <li>Excellent communication and presentation skills</li> <li>Hands-on mentality, with a proven ability to get things done in high quality</li> <li>Can-do attitude to challenges and high sense of ownership over your entrusted product domain</li> <li>English proficiency is a must!</li> </ul> <p> </p> <p> </p> <p> </p> <p> </p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"Leadership Skills"},{"name":"Английский язык"},{"name":"SQL"},{"name":"MS Visual Studio"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"17.333","name":"Услуги для бизнеса","profarea_id":"17","profarea_name":"Продажи"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"938231","name":"Gett","url":"https://api.hh.ru/employers/938231?host=hh.ru","alternate_url":"https://hh.ru/employer/938231","logo_urls":{"240":"https://hhcdn.ru/employer-logo/3835888.png","90":"https://hhcdn.ru/employer-logo/3835887.png","original":"https://hhcdn.ru/employer-logo-original/848753.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=938231&host=hh.ru","trusted":true},"published_at":"2021-06-04T19:37:45+0300","created_at":"2021-06-04T19:37:45+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=44805799","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/44805799","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}