{"id":"44847860","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Data Analyst (Sales, AM and Retention)","insider_interview":null,"response_letter_required":false,"area":{"id":"115","name":"Киев","url":"https://api.hh.ru/areas/115?host=hh.ru"},"salary":null,"type":{"id":"direct","name":"Рекламная"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Why Glovo?</strong></p> <p>Are you looking for a career where you can innovate, fail, learn and GROW! If that’s your case,Glovo is your place. Glovo is amongst the highest growing startups in the world and expandingvery fast. Glovo is a hyperlocal marketplace featuring the most trendy places in each city, and delivers their products in less than 45 mins. The Commercial team is directly responsible for partnering with both local stores and with bigger brands to display them in the Glovo platform. At Glovo, it is in our DNA to do more with less and your job will be to optimize the sales department across all regions. You will be a key member in the Commercial Intelligence Team, working hand-by-hand with UA Commercial team, Head of Sales, Chains, LongTail and AMs business units. Concretely, you will lead the sales, account management performance analysis with the goal of growing Glovo at the same time as our partners grow avoiding churn and increasing partners satisfaction.</p> <p><strong>You will:</strong></p> <ul> <li>Be part of the Commercial Data team</li> <li>Be key in the commercial analysis.</li> <li>Define and develop tools and processes to improve our account management and sales processes.</li> <li>Define and develop tools and processes to improve our targeting process and reduce our partners churn.</li> <li>Automate manual processes. You are going to be the owner of sources integration: Amazon redshift to Salesforce, S3 buckets processes,…</li> <li>Be the point of contact of ours Heads of Commercial, Sales and Heads of Chains and AM.</li> <li>Effectively use and implement BI tools or processes to improve performance management and decision making</li> <li>Be proactive proposing new growth hacks</li> <li>Be key in our partners segmentation process</li> </ul> <p><strong>Requirements:</strong></p> <ul> <li>Bachelor in Engineering, Maths, Physics or Informatics</li> <li>Master degree in Data Analytics, Data Science or Programming languages is a plus.</li> <li>+1 year experience in Analytics or Data Science positions</li> <li>Salesforce or other CRM knowledge is required</li> <li>Other Programming languages required: SQL. Other codes knowledge are a plus</li> <li>Marketing intelligence or Sales Analytics experience is a plus</li> <li>Knowledge of Business Intelligence tools: Data Studio, Qlik, Board or similar</li> <li>Proactive, organised, and obsessed with detail and accuracy</li> <li>Have excellent communication skills. Detail oriented, strong grammar and writing skills</li> <li>Self-starter who is able to work in a highly demanding environment.</li> <li>Preferably with experience in a high-growth digital startup business</li> <li>Experience in Python coding (Proficiency level in: Numpy, Pandas and Other sources connections as Salesforce, Amazon S3) is a plus</li> </ul> <p><strong>Benefits:</strong></p> <ul> <li>Competitive salary negotiable based on experience</li> <li>Cozy office in the city center</li> <li>Great peers and team culture!</li> <li>Free Glovo credits</li> <li>The opportunity to change the world and see how everyone uses the product you build Work in an international, dynamic and passionate environment with a great company culture</li> </ul> <p>If you believe you match these values, we look forward to meeting you! At Glovo we believe that diversity adds incredible value to our teams, our products, and our culture. We know that the best ideas and solutions come by bringing together people from all over the world and by fostering a culture of inclusion where everyone feels heard and has the chance to make a real impact. It’s because of this that we are committed to providing equal opportunities to talent from all backgrounds. Wanna take a peek into what it’s like to work at Glovo?</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Python"},{"name":"Marketing Analysis"},{"name":"CRM"},{"name":"Negotiation skills"},{"name":"C++"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":"https://couriers.glovoapp.com/ua/?utm_source=olx&utm_medium=platform&utm_campaign=&city_code=KIE","specializations":[{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"3.26","name":"Аналитик","profarea_id":"3","profarea_name":"Маркетинг, реклама, PR"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"4342489","name":"Glovo","url":"https://api.hh.ru/employers/4342489?host=hh.ru","alternate_url":"https://hh.ru/employer/4342489","logo_urls":{"90":"https://hhcdn.ru/employer-logo/3222068.png","240":"https://hhcdn.ru/employer-logo/3222069.png","original":"https://hhcdn.ru/employer-logo-original/695238.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=4342489&host=hh.ru","trusted":true},"published_at":"2021-05-24T19:48:33+0300","created_at":"2021-05-24T19:48:33+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=44847860","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/44847860","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}