{"id":"44847764","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Senior Product Manager","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>⭐ <strong>SUMMARY</strong></p> <p>We are Pixellu, a software company on a mission to simplify professional photographers’ lives. We are seeking a world-class Product Manager to manage our new product - Pixellu Galleries. You’ll be working directly with the Head of Product &amp; CEO to develop a product vision and execute on that vision with the help of Product Designers and Engineering.</p> <p><em>This is not a “sit in the office and plan” role. This is a role where you will be with the exec team one day, and in the trenches the next. Expect to roll up your sleeves and be in the weeds, doing the work.</em></p> <p>ABOUT YOU</p> <p>Aside from the job description, here is what we most value in a candidate:</p> <ul> <li><strong>Communication: </strong>Excellent written &amp; verbal communication skills.</li> <li><strong>Problem-solving:</strong> rather someone who is intellectually curious, quick learner, and unafraid to tackle challenging problems.</li> <li><strong>Creativity: </strong>Ability to think outside the normal product box of features to solve business problems.</li> <li><strong>Leadership: </strong>Ability to lead teams; emotionally intelligent and able to motivate people of different backgrounds and personalities.</li> <li><strong>Passion: </strong>A passion for products and for solving customer problems.<strong> </strong></li> </ul> <p>REQUIRMENTS</p> <ul> <li>Demonstrated understanding of the techniques and methods of modern product discovery and product delivery.</li> <li>4+ years working on technology-powered products as either a product manager, product designer, engineer, data analyst, data scientist, or user researcher.</li> <li>Demonstrated ability to learn multiple functional areas of business – engineering, design, finance, sales, or marketing.</li> <li>Demonstrated ability to figure out solutions to hard problems with many constraints, using sound judgment to assess risks, and to lay out your argument in a well-structured, data-informed, written narrative.</li> <li>Proven ability to engage with engineers, designers, and company leaders in a constructive and collaborative relationship.</li> </ul> <p> </p> <p>️ BENEFITS</p> <ul> <li>Work from anywhere.</li> <li>Flex-time; aside from &quot;required online hours&quot; of 7-11am Pacific Time, work hours are fully flexible.</li> <li>Competitive salary based on experience level and your local cost of living considerations.</li> <li>Quarterly profit-sharing bonuses based on seniority and role.</li> <li>Paid parental leave.</li> <li>20 annual days off, with the ability to make up missed days on weekends. <p>ABOUT THE JOB</p> <p>Pixellu currently has three products - SmartAlbums, SmartSlides, and Galleries. We are looking for a Product Manager for our latest product, Galleries.</p> <p>We empower our product teams to solve hard problems – customer problems and business problems – in ways that our customers love, yet work for our business. Our product teams are cross-functional and durable, generally comprised of a product manager, a product designer, and several engineers.</p> <p>We staff our product teams with the skills necessary to come up with effective solutions that are valuable (our customers choose to buy or use), viable (the solution works within the many constraints of the business), usable (the user can figure out how to use) and feasible (our engineers have the skills and technology to implement).</p> <p><br />While we empower our product teams to figure out the best solutions to the problems that need to be solved, we also hold those teams accountable for the results. Shipping is necessary, but not sufficient. We look for product managers that are not afraid of signing up for results, even when this means they have to work through others to achieve the necessary results.</p> </li> </ul> <p> </p> <ul> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Leadership Skills"},{"name":"Time management"},{"name":"Sales Skills"},{"name":"Business Development"},{"name":"Product Marketing"},{"name":"Product Management"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.246","name":"Развитие бизнеса","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.327","name":"Управление проектами","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"3716247","name":"Pixellu","url":"https://api.hh.ru/employers/3716247?host=hh.ru","alternate_url":"https://hh.ru/employer/3716247","logo_urls":{"90":"https://hhcdn.ru/employer-logo/2823943.png","240":"https://hhcdn.ru/employer-logo/2823944.png","original":"https://hhcdn.ru/employer-logo-original/595672.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=3716247&host=hh.ru","trusted":true},"published_at":"2021-05-24T19:39:15+0300","created_at":"2021-05-24T19:39:15+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=44847764","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/44847764","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}