{"id":"44938096","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"SQL Data Engineer","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>To further evolve our product and scale the business globally, we are looking for an experienced <strong>Data Engineer</strong> who will be responsible for improving our Data Transformations architecture, Machine Learning algorithms, Data Mining processes, and delivering scalable and beautiful data solutions within our <strong>core product</strong>.</p> <p>This is a perfect opportunity for someone who has excellent SQL knowledge, really high standards, and experience with Google BigQuery to further innovate and improve the expertise in Data Engineering by working with the best data professionals building a truly global and successful marketing &amp; tech product.</p> <p>If you are really passionate about AI &amp; ML, enjoy working with the latest data technologies and tools, and want to make a great impact on our global success, you found the right place.</p> <p>About us:</p> <p>At <strong>SegmentStream</strong>, we are building a cutting-edge marketing technology that is changing how leading businesses analyze and optimize the performance of their online marketing campaigns.</p> <p>Our SaaS platform helps advanced digital marketing teams apply our own sophisticated machine learning algorithms to reveal the true incremental value of each marketing channel and campaign, and automatically apply these AI-insights to close the loop of data-driven marketing.</p> <p>We’ve proven that our technology works and delivers the best ROAS possible for our enterprise clients across the globe. Check our latest success stories and you’ll understand why our solution is the next big thing in the digital marketing world.</p> <p>We are fortunate to be VC-backed by one of the world’s leading startup accelerators - <strong>TechStars</strong>, as well as some biggest names in the B2B SaaS world, including the founders of <strong>Pipedrive</strong>, <strong>Dynamic Yield</strong>, and other great companies. We are also proud to say that SegmentStraem is already trusted by over 50 enterprise customers around the world, including the UK, US, Canada, Australia, and lots of European countries.</p> <p>About the Data Transformations:</p> <p>While SegmentStream platform is really easy to use for our final users — Digital Marketing teams — under the hood there lies a very advanced, high-load, and innovative <strong>Data Transformations</strong> module.</p> <p>Data Transformations work on top of Google BigQuery data warehouse where terabytes of data collected each day. By connecting Google BigQuery to SegmentStream’s Data Transformations module, Data analysts are able to easily create &amp; run smart and fully automated data transformation workflows to clean, transform, stitch and update the data, making it fully ready for further analysis.</p> <p>For example, it helps to transform all the raw data from dozens of different data sources into a single table fully ready for data visualization, machine learning, marketing automation, and other great things, all across 50+ of our enterprise clients with massive datasets.</p> <p>This is our own development and technology that is based on Kubernetes and Argo (the same stack is used by Tesla, Nvidia, Google, GitHub, and other great companies). We really proud of it and we think that this is one of our most important unique competitive advantages.</p> <p>We will happy to tell you more about this and answer your questions during the interview process.</p> <p>Responsibilities:</p> <ul> <li>Develop and improve the <strong>Data Transformations</strong> module to increase the performance and user experience while minimizing the computing cost and the amount any technical issues;</li> <li>Pro-actively find issues with current data architecture and prepare elegant technical solutions to mitigate these risks in the future;</li> <li>Prepare re-usable and scalable SQL data transformations templates that will solve various challenges in the area of advanced marketing analytics and optimization;</li> <li>Constantly innovate on our overall data architecture and ML algorithms to trust the data and insights that our customers (leading brands with 6-8 figure monthly ad spend) will analyze and make really important marketing decisions;</li> <li>Gather feedback and feature requests from the users of our Data Transformations module — both external (clients) and internal (our Marketing BI team) to understand how to improve the product further;</li> <li>Act on the feedback by working closely with our Product team to prioritize and define a product roadmap and engineering backlog;</li> </ul> <p>Requirements:</p> <ul> <li>A degree in <strong>Computer Science, Math, Statistics</strong> or similar;</li> <li><strong>3+ years</strong> of relevant experience (Data Transformations, ETL/ELT, Data Modeling in the cloud);</li> <li>Expert-level <strong>SQL</strong> knowledge (you would rate your SQL skills <strong>&gt;8/10</strong>);</li> <li>Experience working with <strong>Google BigQuery</strong>;</li> <li>Experience with Machine Learning (<strong>Google BigQuery ML</strong> is a bonus);</li> <li>Knowledge of Digital Marketing and Web Analytics domain area will be a <strong>huge bonus</strong>;</li> <li>High standards — you prefer an elegant and scalable technical solution to some dirty ad-hoc hacks;</li> <li>Product mindset — you care about the product you build, and how it will be used by other people;</li> <li>Great communication skills and positive personality to work in a team;</li> <li>A desire to join a fast-growing global tech startup and make a real impact on its success;</li> <li>Ability to speak and write in English with confidence (<strong>B2 or higher</strong>);</li> </ul> <p>Why SegmentStream:</p> <ul> <li>Unique and high-quality SaaS product that solves a massive problem for a huge market;</li> <li>A vast portfolio of enterprise customers around the globe including the UK, US, Canada, Australia, and lots of European countries;</li> <li>VC-backed by top investors &amp; angels, including TechStars, founders of Pipedrive, Dynamic Yield, and other great SaaS entrepreneurs;</li> <li>Fast-growing, fully distributed, and international team of smart people who not only love what they do but also really good at it;</li> <li>A great company culture that is embracing functional ownership, entrepreneurial mindset, and personal growth;</li> <li>Full responsibility from day one and being part of our results-driven working environment;</li> <li>A lot of opportunities for future career growth within the company;</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"SQL"},{"name":"Data Mining"},{"name":"Data Transformation"},{"name":"ETL"},{"name":"Google BigQuery"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.474","name":"Стартапы","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1564038","name":"SegmentStream","url":"https://api.hh.ru/employers/1564038?host=hh.ru","alternate_url":"https://hh.ru/employer/1564038","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/635972.png","90":"https://hhcdn.ru/employer-logo/2985040.png","240":"https://hhcdn.ru/employer-logo/2985041.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1564038&host=hh.ru","trusted":true},"published_at":"2021-05-27T11:39:19+0300","created_at":"2021-05-27T11:39:19+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=44938096","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/44938096","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}