{"id":"45151217","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Middle/Senior Data Analyst (Dispatch)","insider_interview":null,"response_letter_required":false,"area":{"id":"1","name":"Москва","url":"https://api.hh.ru/areas/1?host=hh.ru"},"salary":{"from":160000,"to":null,"currency":"RUR","gross":false},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Ситимобил — </strong>IT-компания, которая движется в сторону Urban mobility. Мы не просто создаем сервис заказа такси, а разрабатываем, поддерживаем и улучшаем современную платформу, решающую проблему передвижения по городу.</p> <p>В Департаменте аналитики и эффективности платформы сейчас более 70 человек (аналитики, DS, технические продакты, BI , инженеры по данным), и мы продолжаем активно расти и развиваться, работая не только над сервисом такси, но и над доставкой и каршерингом.<br />Вся Data Team занимается задачами, которые тем или иным образом связаны с данными. Мы выделяем три основных направления:<br />1. Инфраструктура по работе с данными. Здесь мы строим централизованное хранилище данных, развиваем BI, делаем инструменты для удобной работы с данными.<br />2. Бизнес-аналитика. Сюда попадают продуктовая, маркетинговая и операционная аналитика. Это децентрализованная функция. Ребята работают напрямую с бизнес-функциями и являются бизнес-партнерами. Здесь мы приносим полезные инсайты про то, как растить бизнес и как оптимизировать затраты.<br />3. Эффективность платформы. Здесь в продуктовых командах мы делаем продукты и алгоритмы, по которым работает маркетплейс. Сюда, например, относятся динамическое ценообразование, распределение заказов, антифрод.</p> <p><strong>Marketplace</strong></p> <p><strong>Задача нашего направления – </strong>сделать по-настоящему надежный сервис заказа такси. Мы стремимся сделать так, чтобы каждый пассажир всегда смог уехать по выгодной цене, а заработок водителя постоянно рос. Для решения этой задачи наша команда создает масштабируемые продукты и алгоритмы, которые способны в реальном времени реагировать на изменения баланса спроса и предложения, решая сложные оптимизационные задачи в меняющихся ограничениях.</p> <p><strong>Dispatch</strong></p> <p>Одной из команд Marketplace является Dispatch – команда распределения заказов. Эффективные алгоритмы назначения водителей на заказ приводят к снижению времени ожидания и увеличению заработка водителей. Задачей нашего направления является создание масштабируемых механизмов назначения, превосходно работающих как в целом по городам, так и в разрезе каждого бизнес-стрима</p> <p><strong>Мы ищем</strong> Data аналитика. <strong>Тебе предстоит </strong>принимать участие в разнообразных задачах: от разработки платформы для различных механик экспериментов и построения предиктивных моделей, до генерации продуктовых гипотез и визуализации данных.</p> <p><strong>Задачи, которые предстоит решить за</strong></p> <p>3 месяца:</p> <ul> <li>Погрузиться в текущие механики работы системы</li> <li>Сформировать новые метрики качества работы всей системы и отдельных механик</li> <li>Построить аналитические отчеты с метриками</li> <li>Участвовать в дизайне и расчете экспериментов</li> </ul> <p>6 месяцев:</p> <ul> <li>Провести количественный анализ существующих механик распределения</li> <li>Выделить тонкие места и подтвердить их на данных</li> <li>Провести обзор существующих решений на рынке и научных исследований</li> <li>Сформулировать и проверить гипотезы по улучшению текущих алгоритмов</li> </ul> <p>12 месяцев:</p> <ul> <li>Улучшить ключевые метрики за счет внедрения новых алгоритмов</li> </ul> <p><strong>Мы ждем, что ты:</strong></p> <ul> <li>Имеешь высшее техническое или экономическое образование;</li> <li>Знаешь SQL (мы работаем с MySQL, Exasol и ClickHouse);</li> <li>Хорошо понимаешь математическую статистику и методологию проведения экспериментов;</li> <li>Используешь Python для анализа данных и предиктивной аналитики;</li> <li>Готов погрузиться во весь цикл продуктовой разработки (исследование, постановка задачи на разработку, формирование и проверка гипотез);</li> <li>Кайфуешь от амбициозных задач и смело экспериментируешь;</li> <li>Изучаешь техническую литературу и на русском, и на английском языках;</li> <li>Умеешь строить информативные отчеты в Tableau или в схожих средствах визуализации;</li> </ul> <p><strong>Будет круто, если ты:</strong></p> <ul> <li>Имел опыт работы в компаниях, работающих по модели маркетплейс;</li> <li>Знаком с алгоритмами оптимизации;</li> <li>Проводил пользовательские интервью.</li> </ul> <p><strong>Мы предлагаем:</strong></p> <ul> <li>Официальное оформление и зарплата на уровне топовых IT-компаний России. Конкретный размер зависит от опыта и крутизны кандидата. Ты всегда можешь сказать, во сколько ты себя оцениваешь, и мы попробуем договориться;</li> <li>Классный офис рядом с метро «Сокол», в котором есть все: от теннисных столов до бесплатного пива, которое течет по пятницам из барного крана</li> <li>Бесплатную парковку для сотрудников</li> <li>Любые мелочи, которые могут понадобиться тебе для работы: техника, лицензии на программы и т.п.</li> <li>Расширенную медицинскую страховку с первого рабочего дня</li> <li>Чай, кофе, снеки и фрукты в течение дня;</li> <li>Возможность уходить в отпуск или работать удаленно, когда это нужно, или брать day-off;</li> <li>Заботу о твоем развитии: мы готовы компенсировать практически любую профессиональную литературу, курсы, обучение и участие в профессиональных конференциях и семинарах;</li> <li>Ну и, разумеется, мы предоставляем корпоративную скидку на такси :)</li> </ul> <p>У нас сложные, но интересные задачи по созданию крутого и общественно-полезного продукта, который действительно меняет способ передвижения людей. А также это редкая возможность создавать продукт, которым будут пользоваться многие ваши знакомые.</p> <p><strong>Мы ценим амбициозных, любознательных, ответственных людей и, возможно, ищем именно тебя!</strong></p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"SQL"},{"name":"Python"},{"name":"A/B тесты"},{"name":"Аналитические исследования"},{"name":"Статистический анализ"},{"name":"Статистика"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"188712","name":"Ситимобил","url":"https://api.hh.ru/employers/188712?host=hh.ru","alternate_url":"https://hh.ru/employer/188712","logo_urls":{"240":"https://hhcdn.ru/employer-logo/3803708.png","90":"https://hhcdn.ru/employer-logo/3803707.png","original":"https://hhcdn.ru/employer-logo-original/840707.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=188712&host=hh.ru","trusted":true},"published_at":"2021-06-02T14:34:59+0300","created_at":"2021-06-02T14:34:59+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=45151217","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/45151217","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}