{"id":"45268973","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Data Analyst","insider_interview":null,"response_letter_required":false,"area":{"id":"1002","name":"Минск","url":"https://api.hh.ru/areas/1002?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":{"city":"Минск","street":"проспект Победителей","building":"7А","description":null,"lat":53.907679,"lng":27.549722,"raw":"Минск, проспект Победителей, 7А","metro":{"station_name":"Немига","line_name":"Автозаводская","station_id":"63.422","line_id":"63","lat":53.905615,"lng":27.55415},"metro_stations":[{"station_name":"Немига","line_name":"Автозаводская","station_id":"63.422","line_id":"63","lat":53.905615,"lng":27.55415}]},"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>ABOUT US</strong></p> <p>Inspectorio is a cloud-based SaaS solution focused on creating a dynamic and risk-assessment based Quality and Compliance program with the goal of generating more sustainable and transparent supply chains. Our network is a one-stop-shop platform where all key stakeholders in the production process can connect to execute, monitor, and report on Quality and Compliance activities.</p> <p>Our products provide digitization, automation, transparency, and traceability, with a strong focus on advanced analytics &amp; Machine Learning. This enables us to leverage customer data for predictive insights and dynamic risk-based interventions.</p> <p>Founded in 2016, Inspectorio set out to revolutionize the supply chain industry. Today, we work with many of the world’s leading brands and retailers, and over thousands of vendor and factory organizations across the globe to bring unparalleled levels of visibility, transparency, and accuracy to their quality, sustainability, and compliance initiatives!</p> <p><strong>JOB SUMMARY</strong></p> <p>We are looking for a Data Analyst to work closely with the Sales Manager. Your role will be to work with databases and collect potential customer data. You will also work on contributing to the continuous improvement of the Business Development team helping to approach new sources of potential customers information. Ultimately, you will boost the sales pipeline and contribute to our long-term business growth assigned portfolio of clients.</p> <p><strong>RESPONSIBILITIES:</strong></p> <ul> <li>Interpret data, analyze results using statistical techniques and provide ongoing forecasting reports on potential opportunities</li> <li>Analyze databases, data collection systems to find the potential sales opportunities</li> <li>Acquire data from primary or secondary data sources and maintain databases/data systems for sales</li> <li>Research on the new databases and data sources to fuel sales process</li> </ul> <p><strong>REQUIREMENTS:</strong></p> <ul> <li>Proven working experience as a data analyst or business analyst</li> <li>Familiarity with restful API’s working principles</li> <li>Strong SQL skills</li> <li>Programming skills: R or Python (pandas)</li> <li>Technical experience regarding data models, database design development, data mining and segmentation techniques</li> <li>Strong knowledge and experience with reporting packages and databases.</li> <li>Excellent written and verbal communication skills in English</li> </ul> <p><strong>PREFERABLE QUALIFICATIONS:</strong></p> <ul> <li>Knowledge of statistics and experience using statistical packages for analyzing datasets</li> <li>Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li> <li>A degree Mathematics, Economics, Computer Science, Information Management or Statistics</li> </ul> <p><strong>Why it would be awesome to work with us</strong></p> <p><strong>PERKS</strong></p> <p><strong>Competitive Salary</strong></p> <p>At Inspectorio, we only work with the best of the best. That’s why, if we invite you to join us, it’s because we recognize your amazing skills, value, and potential. It probably wasn’t easy for you to become this awesome, so we make sure to reward you for it.</p> <p><strong>Full Project Ownership</strong></p> <p>Are you an inventor? Want to start a new internship program? How about a soccer tournament? Or a whole new department within the company? Whatever it is that you want to do, we’re here to listen, and if your idea is good, we’ll give you all the resources you need to make it happen. When any Inspectorian wins, we all win.</p> <p><strong>Personal and Professional Growth</strong></p> <p>Inspectorians are our most valuable resource, so we make sure to invest heavily in them. All Inspectorians are eligible for funding to attend conferences, take courses, present their research, and more. This on top of the continuous mentoring and guidance you’ll receive guarantees you’ll grow as a professional and as a human while at Inspectorio.</p> <p><strong>Fun, Fun, Fun</strong></p> <p>We put our money where your smiles are. Company-sponsored trips, weekly parties, sporting events, and more. We make sure that Inspectorians enjoy coming to work by promoting as much fun as we can.</p> <p><strong>International Work Experience</strong></p> <p>We are going to take over the world... Perhaps not quite, but we are a global company that thrives from the interactions between our different offices. Join us to work alongside Belarusians in Vietnam, Mexicans in Minsk, Filipinos in China, and more.</p> <p><strong>Our Values</strong></p> <p><strong>EXCELLENCE</strong></p> <p>We pursue mastery and craftmanship. “Good enough” is our enemy. We have a thirst and desire for knowledge and continuous improvement because there’s always an opportunity to be better.<br />We always find time to help and learn from others.</p> <p><strong>AUTONOMY</strong></p> <p>We act independently when we recognize an opportunity for improvement. We seek guidance, alignment, and clear goals instead of orders or hand-holding. We self-assess the quality and impact of our work, identify opportunities to improve, and make changes proactively.</p> <p><strong>COURAGE</strong></p> <p>We share our opinion and insights, even if it’s uncomfortable. We are candid and direct with everyone we work with. We are willing to experiment and try something new, even if we’re not sure it will succeed.</p> <p><strong>HUMBLENESS</strong></p> <p>We crave opportunities to learn from the people around us. We focus on listening to other perspectives because we know we don’t have all the answers or best solutions. We recognize that vanity and ego are the enemies of great ideas and outstanding products.</p> <p> </p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Data Mining"},{"name":"Python"},{"name":"Presentation skills"},{"name":"SQL"},{"name":"Business Analysis"},{"name":"Data Analysis"},{"name":"Big Data"},{"name":"MS Excel"}],"accept_handicapped":true,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.203","name":"Передача данных и доступ в интернет","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.420","name":"Администратор баз данных","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"4270886","name":"Инспекторио Бел","url":"https://api.hh.ru/employers/4270886?host=hh.ru","alternate_url":"https://hh.ru/employer/4270886","logo_urls":{"90":"https://hhcdn.ru/employer-logo/3261684.png","240":"https://hhcdn.ru/employer-logo/3261685.png","original":"https://hhcdn.ru/employer-logo-original/705142.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=4270886&host=hh.ru","trusted":true},"published_at":"2021-06-10T15:10:55+0300","created_at":"2021-06-10T15:10:55+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=45268973","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/45268973","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}