{"id":"45299895","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Business Analyst","insider_interview":null,"response_letter_required":false,"area":{"id":"160","name":"Алматы","url":"https://api.hh.ru/areas/160?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"site":{"id":"hh","name":"hh.ru"},"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Do you want to be a part of fast growing and developing company, being engaged in helping people? Do you like numbers, analysis and driving change? Does driving design and insight projects implementation at the Global level interest you? If yes join us by applying for the new role of Business Analyst.</p> <p> </p> <p>Novo Nordisk is a global healthcare company with more than 95 years of innovation and leadership in diabetes care. This heritage has given us experience and capabilities that also enable us to help people defeat obesity, haemophilia, growth disorders and other serious chronic diseases. Headquartered in Denmark, Novo Nordisk employs over 45,000 people in 80 countries, and markets its products in more than 169 countries.</p> <p> </p> <p><strong>The position</strong></p> <p>We are looking for a Business Analyst to join us for the <strong>-maternity leave cover</strong>. This position will report to the Commercial Affairs Head.</p> <p> </p> <p>As a Business Analyst, you will be responsible for business planning process by developing and maintaining edge tools and systems within Central Asia and Caucasus (CEM) region. You will be actively engaged in data management activities: data analysis, reports and sharing with internal stakeholders -</p> <p> </p> <p>You will develop, improve and be fully responsible for market understanding tools, also supporting marketing department with forecasting management, as well as actively involved in , market understanding researches.</p> <p> </p> <p>In this role you will provide interactive feedback sessions to field force employees on improvement of their analytical skills and provide trainings on practical aspects by demand. You will manage price related tasks internally (via corporate specialized systems) and externally for the CEM region, as well as prepare of all necessary documentation regarding price registration and price changes in corporate system and for external stakeholders.</p> <p> </p> <p><strong>Qualifications</strong></p> <p>You have BS or MS degree. At least 3 years’ experience in the similar positions. Knowledge and experience of working with different analytical tools.</p> <p> </p> <p>You have an in-depth understanding of the role of data analyst in pharmaceutical industry. You are able to work with cross-functional stakeholders. You have excellent communication skills. You are driven, can take initiative, and are agile in actions. Your personality is aligned with our Novo Nordisk Way and you are fluent in both written and spoken English.</p> <p> </p> <p> </p> <p><strong>About the department</strong></p> <p>Commercial Affairs department in Kazakhstan is a part of a fast-growing and developing department for CEM region. You will work in a diverse team, which includes product managers, MCE manager, Event coordinator,. It is an exciting time to join Novo Nordisk and achieve our strategic aspirations to establish global presence. We’re a dynamic company in an even more dynamic industry, and we know that what got us to where we are today is not necessarily what will make us successful in the future.</p> <p> </p> <p><strong>Working at Novo Nordisk</strong></p> <p>At Novo Nordisk we recognise that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and the communities we operate in.</p> <p> </p> <p>We commit to an inclusive recruitment process and equality of opportunity for all our job applicants. We are happy to discuss flexible working, depending on the role and subject to business needs.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Analytical skills"},{"name":"Presentation skills"},{"name":"Английский язык"},{"name":"Data Analysis"},{"name":"Анализ данных"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.25","name":"Аналитик","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"3.26","name":"Аналитик","profarea_id":"3","profarea_name":"Маркетинг, реклама, PR"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"20795","name":"Ново Нордиск","url":"https://api.hh.ru/employers/20795?host=hh.ru","alternate_url":"https://hh.ru/employer/20795","logo_urls":null,"vacancies_url":"https://api.hh.ru/vacancies?employer_id=20795&host=hh.ru","trusted":true},"published_at":"2021-06-08T12:40:15+0300","created_at":"2021-06-08T12:40:15+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=45299895","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/45299895","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false}